{"url": "https://support.zipcar.com/hc/en-us/articles/211870908-My-Zipcar-won-t-start-what-should-I-do", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/211870908.json", "title": "My Zipcar won't start, what should I do?", "last_updated": "2024-04-07T08:17:00Z", "section_id": 360004492634, "body": "If you're in your Zipcar but are unable to start it, here are a few things to try: Make sure your foot is on the brake when turning the ignition or pressing the push-to-start button If the steering wheel is locked (you're unable to move it left or right), turn the wheel as far as you can to the right while trying to start the car Try unlocking the car again (even if you're inside it) using your iPhone ® or Android ™ mobile app or by tapping your Zipcard on the card reader If the car has a push-to-start ignition and the key is accessible, ensure it is within close proximity to the steering wheel when pushing the ignition button Confirm your booking time has not elapsed (if it has, you may need to create another booking or call in for assistance)", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/212542967-Can-I-begin-my-Zipcar-trip-early", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/212542967.json", "title": "Can I begin my Zipcar trip early?", "last_updated": "2024-02-27T21:46:20Z", "section_id": 115000306287, "body": "If there is no booking right before your trip, you can take the car up to 14-minutes early at no additional charge. If the car is not available, or if the prior ride has not yet ended, you will not be able to begin your trip early and will need to wait until the start time of your booking.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/212543127-What-can-I-do-if-my-car-is-dirty-damaged-needs-maintenance-or-has-low-fuel-at-the-start-of-the-trip", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/212543127.json", "title": "What can I do if my car is dirty, damaged, needs maintenance, or has low fuel at the start of the trip?", "last_updated": "2024-04-13T16:26:55Z", "section_id": 115000306287, "body": "Before you begin your trip, we ask that you take a moment to inspect your Zipcar inside and out and report any problems. This will help ensure our vehicles get the care they need, and you are not held responsible for any issues. If you find your car is not in the condition you expected, let us know. That might include: Damage, including scratches or dents larger than a credit card Fuel left below ¼ tank Dirty vehicles, including litter, smoke, pet hair, and more Missing fuel cards or parking passes Warning lights, flat tires, and other maintenance issues To make a pre-ride condition report: Open the Zipcar iPhone ® or Android ™ app Go to the Drive screen Click Report and submit a record of the issue(s) Keep In Mind If your car is not in drivable condition or is unacceptable to you, give us a call and we will work to find you a more suitable vehicle", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/212543177-Where-can-I-find-my-Zipcar-s-keys", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/212543177.json", "title": "Where can I find my Zipcar's keys?", "last_updated": "2024-04-26T15:56:32Z", "section_id": 115000306287, "body": "The location of the keys might depend on the car and the type of ignition it has. For push-to-start vehicles, the keys are typically hidden within the vehicle. Don't worry, that's OK. Because the keys should remain within the car throughout your trip, you shouldn't need access to the car's key to turn on and off the vehicle. For cars with a more traditional bladed key , the keys will typically be tethered to the steering column of the vehicle. If you don't see them, check the cup holder, glove compartment, and side door compartments in case the last driver placed them there. If you cannot find the keys anywhere inside of the vehicle, give us a call for further assistance.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/220111728-Am-I-able-to-receive-a-Zipcard-or-a-replacement", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/220111728.json", "title": "Am I able to receive a Zipcard or a replacement?", "last_updated": "2024-04-22T18:36:50Z", "section_id": 360004537873, "body": "If you would like to receive a new or replacement Zipcard, please complete the following steps: Sign in to your Zipcar account Submit a request for a Zipcard Keep In Mind All US Zipcars can be locked & unlocked via the Zipcar iPhone ® and Android ™ app and a Zipcard is not required Be sure the mailing address on your account is up-to-date We'll replace or provide up to 1 Zipcard per year at no charge (additional cards are subject to $15 replacement fee)", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/220273868-The-fuel-card-is-missing-from-my-Zipcar-what-should-I-do", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/220273868.json", "title": "The fuel card is missing from my Zipcar, what should I do?", "last_updated": "2024-04-21T19:45:23Z", "section_id": 360004492634, "body": "If the fuel card is missing, let us know. From the Zipcar iPhone ® or Android ™ app, open the Drive screen and select Report to notify us of vehicle issues. If you can, please pay for fuel on your own and submit your receipts to be reimbursed . Keep In Mind Fuel cards are located in the driver's side visor", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/220273928-How-do-I-edit-or-extend-my-Zipcar-booking", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/220273928.json", "title": "How do I edit or extend my Zipcar booking", "last_updated": "2025-12-23T18:35:57Z", "section_id": 115000306307, "body": "To edit your Zipcar booking use the Zipcar mobile app on iPhone ® or Android ™ devices. Booking modifications can be made before or during your trip. Once your trip has ended, bookings can no longer be modified. Extend Your Trip During an Active Reservation Quick Extend (Up to 2 Hours) If your trip is already in progress, you can extend it directly in the Zipcar app. Open the Zipcar app. Navigate to the Drive tab. Tap Extend. Select an available extension time slot (Unavailable times are greyed out). Tap Confirm and Pay to complete the extension. Extend for More Than 2 Hours On the Zipcar app, navigate to the Drive tab. Tap Extend to open the extend screen. On the Extend screen, tap View Full Availability. You will be redirected to the Edit trip page, tap Edit trip. Select Drop-Off Time to open the time selection wheel (Unavailable times are greyed out). The new cost of your reservation will be shown on the update button, tap Update to save your changes. Modify Your Reservation (Before or During Your Trip) Use these steps to edit a trip before it starts, shorten a trip, or make longer extensions. Go to the Trips tab and select View Details under your active or upcoming trip. Once on the trip screen, tap Edit Trip to make changes. Select Drop-Off Time to open the time selection wheel (Unavailable times are greyed out). The new cost of your reservation will be shown on the update button, tap Update to save your changes. Keep In Mind If the car appears unavailable, it means you cannot book that time frame, and the car must be returned by your scheduled reservation end time. If you have text alerts enabled in your notification settings, you can extend your trip by replying to us via SMS", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/220274128-What-can-I-do-if-I-m-running-late-but-unable-to-extend-my-trip", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/220274128.json", "title": "What can I do if I'm running late but unable to extend my trip?", "last_updated": "2024-04-02T02:13:57Z", "section_id": 115000306307, "body": "If you're running late and are unable to extend your trip, it is likely because the car is unavailable for the timeframe following your trip. Call us at 866-4ZIPCAR as soon as you realize you will not be returning on time and are unable to extend so we can assist Keep In Mind Note that returning late can result in a fee .", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/220278288--Is-a-toll-pass-included-in-my-Zipcar", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/220278288.json", "title": " Is a toll pass included in my Zipcar?", "last_updated": "2024-04-29T15:55:46Z", "section_id": 115000306187, "body": "No, toll passes are not included in Zipcars. Zipcars use the pay-per-plate method. When you use a toll lane, the car will incur the toll based on its license plate, and this amount will be charged to your Zipcar invoice using the pay-per-plate method. Keep In Mind Do not use a personal toll pass as this may result in double-charging by the toll authority, and Zipcar is unable to remove toll charges incurred during a reservation", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/220333468-How-is-my-booking-billed", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/220333468.json", "title": "How is my booking billed?", "last_updated": "2025-02-10T20:59:02Z", "section_id": 115000306327, "body": "When creating a new booking, you'll be able to select your desired payment method at checkout. A hold will initially be placed on the chosen payment method for the cost of the trip. After a short period, the charge will be directly applied to your account. If there are any promotions, discounts, and driving credit available on the account, it will automatically be applied at the time of booking. If backup payments are enabled on your account and your default card declines the charge, the next payment method on your account will be charged for any outstanding amounts. Additional mileage costs, toll charges, and traffic violations will be added to the trip charges once they are received and processed by Zipcar. It is common for these charges to appear several weeks after the trip. Keep In Mind If you book with Google or Apple Pay, any additional charges incurred after the initial booking will be billed to your default card on file.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/220333508-What-is-driving-credit-and-how-does-it-work", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/220333508.json", "title": "What is driving credit and how does it work?", "last_updated": "2024-03-26T17:13:07Z", "section_id": 115000306327, "body": "Driving credit is credit that can be applied to the cost of a future trip. Driving credit may be automatically applied to your account per your rate plan, applied following a poor experience with the service, or redeemed as part of a promotion. Here are some things to know about driving credit: Driving credit is non-transferrable Driving credit will be available and usable by all drivers on your account It is not possible to apply driving credit to a specific trip, it will always be applied to the next booking created Driving credit cannot be applied to ongoing or past trips Driving credit only covers booking costs, and does not cover fees, violations, tolls, & other non-trip charges Credit is available in the currency of the member’s primary driving country, and cannot be applied to reservations in places with a different currency Driving credit expires after a period of time (you can view the expiration of credit on your billing page) Driving credit is applied to the cost of your trip before taxes are calculated", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/220333528-What-local-taxes-might-be-associated-with-my-trip", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/220333528.json", "title": "What local taxes might be associated with my trip?", "last_updated": "2024-04-30T18:21:34Z", "section_id": 4415635273491, "body": "Taxes are automatically calculated and charged at the time a booking is made. Only applicable taxes will be charged to your booking. Not all taxes listed below may apply to your trip. Taxes are subject to change. Alabama AL Auto Rental Tax 1.500% of charges AL Birmingham Lease Tax 0.750% of charges AL Huntsville Rental Tax 1.500% of charges AL Tuscaloosa Auto Rental Tax 0.500% of charges Arizona AZ Glendale City Tax 2.900% of charges AZ Maricopa Cnty Rental Surchrg ($2.50min) 3.250% of charges or at least $2.50 AZ Maricopa County Personal Property Rental Tax 6.300% of charges AZ Mesa City Tax 2.000% of charges AZ Personal Property Rental Tax 6.100% of charges AZ Phoenix City Tax 4.300% of charges AZ PHX Customer Facility Charge incl Tax $6.94 per reservation per day AZ Pima County Rental Surcharge $3.50 per reservation AZ Tempe Sales Tax 1.800% of charges AZ Tucson City Tax 2.600% of charges AZ Vehicle Rental Surcharge 5.000% of charges Arkansas AR Benton County Sales Tax 1.000% of charges AR Fayetteville City Sales Tax 2.000% of charges AR Highfill City Sales Tax 2.000% of charges AR Little Rock City Sales Tax 1.500% of charges AR Pulaski County Sales Tax 1.000% of charges AR State Sales Tax 6.500% of charges AR State Vehicle Rental Tax 10.000% of charges AR Washington County Sales Tax 1.250% of charges British Columbia CN BC Passenger Vehicle Tax CAD$1.58 per reservation per day 8 hours or greater CN British Columbia PST 7.000% of charges CN Goods & Services Tax BC Only 5.000% of charges California CA - El Cerrito Sales Tax 1.500% of charges CA Alameda County District Tax 2.000% of charges CA Arcata City District Tax 0.750% of charges CA Burbank City Sales Tax 0.750% of charges CA Butte County District Tax 4.000% of charges CA City of Los Gatos 0.125% of charges CA City of San Jose 0.250% of charges CA Concord City District Tax 0.500% of charges CA Contra Costa District Tax 1.000% of charges CA Davis City District Tax 1.000% of charges CA Emeryville Sales Tax .250% of charges CA Fresno County Sales Tax 0.725% of charges CA Fresno Yosemite Airport Customer Facility Charge $4.50 per reservation per day CA Glendale City Sales Tax 0.750% of charges CA Half Moon Bay Airport Tax 2.500% of charges CA Hayward City Sales Tax 0.500% of charges CA Humboldt County Transactions Tax 0.500% of charges CA La Verne Sales Tax 0.750% of charges CA LA County District Tax 2.250% of charges CA LAX Customer Facility Charge $7.50 per reservation CA Long Beach City District Tax 0.750% of charges CA Marin County District Tax 1.000% of charges CA Merced City Tax 0.500% of charges CA Merced County Tax 0.500% of charges CA Monterey County District Tax 0.500% of charges CA Napa County Flood Protection Authority Tax 0.500% of charges CA Oakland Airport Customer Facility Charge $10.00 per reservation CA Orange County District Tax 0.500% of charges CA Palm Springs Airport Customer Facility Charge $10.00 per reservation CA Palm Springs City Sales Tax 1.500% of charges CA Pasadena City Sales Tax 0.750% of charges CA Redwood City Sales Tax 0.500% of charges CA Riverside City Sales Tax 1.000% of charges CA Riverside Cnty Dist Tax 0.500% of charges CA Rohnert Park City Sales Tax 0.500% of charges CA Sacramento City Transaction Tax 1.000% of charges CA Sacramento Trans Authority Tax 0.500% of charges CA San Bernardino County Tax 0.500% of charges CA San Bruno County Sales Tax 0.500% of charges CA SAN Customer Facility Charge $7.50 per reservation per day CA SAN Customer Facility Charge $7.50 per reservation per day CA San Diego APO Garage Fee - Includes Tax $3.77 per reservation CA San Diego County District Tax 0.500% of charges CA San Joaquin County Sales Tax 0.500% of charges CA San Luis Obispo City District Tax 0.500% of charges CA San Mateo City Transaction Tax 0.250% of charges CA San Mateo County Sales Tax 1.500% of charges CA San Mateo County Tax 2.000% of charges CA San Rafael City Sales Tax 0.750% of charges CA Santa Barbara Airport Customer Facility Charge $10.00 per reservation CA Santa Barbara City Tax 1.000% of charges CA Santa Barbara County District Tax 0.500% of charges CA Santa Clara County Tax 1.750% of charges CA Santa Cruz City District Tax 0.750% of charges CA Santa Cruz Cnty District Tax 1.250% of charges CA Santa Monica City Transaction Tax 0.750% of charges CA Seaside City Sales Tax 1.500% of charges CA SF District Tax 1.250% of charges CA SFO Transportation Fee $16.00 per reservation CA SJC Customer Facility Charge $7.50 per reservation per day CA Solano County Tax 0.125% of charges CA Sonoma County Sales Tax 1.000% of charges CA South San Francisco City Sales Tax 0.500% of charges CA State & Local Sales Tax 7.250% of charges CA State & Local Sales Tax - Annual Only 7.250% of charges CA Stockton City Sales Tax 1.250% of charges CA Tourism Assessment Fee 3.500% of charges Colorado CO Adams County Ownership Tax 2.000% of charges CO Adams County Sales Tax_RTD 1.850% of charges CO Aurora City Sales Tax 3.750% of charges CO Arapahoe County Rental Tax 2.000% of charges CO Arapahoe County Sales Tax 1.350% of charges CO Boulder City Sales Tax 3.860% of charges CO Boulder County Rental Tax 2.000% of charges CO Boulder County Sales Tax 2.085% of charges CO Colorado Springs Auto Rental Tax 1.000% of charges CO Colorado Springs Sales Tax 3.120% of charges CO DEN Customer Facility Charge $2.43 per reservation per day CO Denver City Rental Tax 2.000% of charges CO Denver City Sales Tax 7.250% of charges CO Denver County Sales Tax 1.100% of charges CO El Paso County Ownership Tax 2.000% of charges CO El Paso County Sales Tax 1.230% of charges CO Ft Collins Sales Tax 3.850% of charges CO Golden City Tax 3.000% of charges CO Greenwood Village Sales Tax 3.000% of charges CO Jefferson County Sales Tax 1.600% of charges CO Lakewood City Sales Tax 3.000% of charges CO Larimer County Rental Tax 2.000% of charges CO Larimer County Sales Tax 0.800% of charges CO Pikes Peak Rural Transportation Authority Sales Tax 1.000% of charges CO Road Safety Program Fee $2.00 per reservation per day CO State Sales Tax 2.900% of charges CO Summit County Rental Tax 2.000% of charges CO Summit County Sales Tax 3.475% of charges CO Town of Breckenridge Sales Tax 2.500% of charges Connecticut CT Bradley Int'l Airport Customer Facility Charge $6.74 per reservation CT Tourism Account Surcharge $1.00 per reservation per day CT Vehicle Rental Tax 9.350% of charges Delaware DE Rental Tax 1.991% of charges Florida FL Alachua County Sales Tax 1.000% of charges FL Bay County Sales Tax 1.000% of charges FL Duval County Sales Tax 1.500% of charges FL Escambia County Sales Tax 1.500% of charges FL Hillsborough County Sales Tax 2.500% of charges FL JAX Airport Customer Facility Charge $2.15 per reservation FL Leon County Sales Tax 1.500% of charges FL Miami-Dade County Sales Tax 1.000% of charges FL Orange County Sales Tax 0.500% of charges FL Orlando Airport - Customer Facility Fee $2.66 per reservation per day FL Palm Beach County Sales Tax 1.000% of charges FL Pensacola Airport Customer Facility Fee $4.57 per reservation per day FL Rental Car Surcharge $2.14 per reservation per day 24 hours or greater FL Rental Car Surcharge - Car Share $1.07 per reservation less than 24 hours FL Sarasota Sales Tax 1.000% of charges FL State Sales Tax 6.000% of charges FL Tampa Int'l Airport Customer Facility Charge $6.46 per reservation FL Volusia County Sales Tax 0.500% of charges Georgia GA ATL Customer Facility Charge incl Tax $5.54 per reservation per day GA Atlanta Vehicle Rental Tax 3.000% of charges GA Bulloch County Sales Tax 4.000% of charges GA Carroll County Sales Tax 3.000% of charges GA Chatham County Sales Tax 3.000% of charges GA Clarke County Rental Tax 3.000% of charges GA Clarke County Sales Tax 4.000% of charges GA Cobb County Rental Tax 3.000% of charges GA Cobb County Sales Tax 2.000% of charges GA College Park Vehicle Rental Tax 3.000% of charges GA Columbus City Rental Tax 3.000% of charges GA Dekalb County Sales Tax 4.000% of charges GA Doraville Rental Tax 3.000% of charges GA East Point Rental Tax 3.000% of charges GA Fulton County Sales Tax 3.750% of charges GA Gwinnett County Sales Tax 2.000% of charges GA Lawrenceville Rental Tax 3.000% of charges GA Muscogee County Sales Tax 4.000% of charges GA Newton County Sales Tax 3.000% of charges GA Richmond County Rental Tax 3.000% of charges GA Richmond County Sale Tax 4.000% of charges GA State Sales Tax 4.000% of charges Hawaii HI Car Sharing Vehicle Surcharge $0.25 per half hour, up to $5.50 per day HI Excise Tax & Oahu Surcharge 4.703% of charges Idaho ID Sales Tax 6.000% of charges Iowa IA Black Hawk County Sales Tax 1.000% of charges IA Poweshiek County Sales Tax 1.000% of charges IA Rental Tax 5.000% of charges IA Sales Tax 6.000% of charges IA Story County Sales Tax 1.000% of charges Illinois IL MPEA Tax 6.000% of charges IL Carbondale Tax 1.000% of charges IL Champaign Vehical Rental Tax 1.000% of charges IL Charleston Rental Tax 1.000% of charges IL Chicago Lease Transaction Tax 9.000% of charges IL Chicago Midway Airport - Customer Facility Charge $4.75 per reservation per day IL Chicago Motor Vehicle Lessor Tax $2.75 per reservation 24 hours or greater IL Chicago O'Hare Airport - Customer Facility Charge $8.00 per reservation per day IL Cook County Vehicle Tax 1.000% of charges IL Deerfield Vehicle Rental Tax 1.000% of charges IL Dekalb Vehicle Rental Tax 1.000% of charges IL Edwardsville Vehicle Rental Tax 1.000% of charges IL Elmhurst Vehicle rental tax 1.000% of charges IL Evanston Vehicle Rental Tax 1.000% of charges IL Grayslake Vehicle Rental Tax 1.000% of charges IL Highland Park Vehicle Rental Tax 1.000% of charges IL Libertyville Vehicle Rental Tax 1.000% of charges IL Naperville Vehicle Rental Tax 1.000% of charges IL Peoria Veh Rental Tax 1.000% of charges IL Springfield Vechicle Rental Tax 1.000% of charges IL Urbana Vehicle Rental Tax 1.000% of charges IL Vehicle Rental Tax 5.000% of charges IL Waukegan Vehicle Rental Tax 1.000% of charges IL Wheaton City Rental Tax 1.000% of charges Indiana IN Auto Rental Excise Tax 4.000% of charges IN Marion County Auto Rental Tax 6.000% of charges IN Sales Tax 7.000% of charges Kansas KS Sedgwich County Sales Tax 1.000% of charges KS State Rental Tax 3.500% of charges KS State Sales Tax 6.500% of charges KS Wichita Broadview Hotel CID Tax 3.000% of charges Kentucky KY Campbell County Motor Vehicle License Fee 3.000% of charges KY State Sales Tax 6.000% of charges Louisiana LA Baton Rouge Sales Tax 5.500% of charges LA Jefferson Sales Tax 4.750% of charges LA Kenner APO Sales Tax 2.000% of charges LA State Rental Tax 3.000% of charges LA State Sales Tax 4.450% of charges Maine ME Short Term Auto Rental 10.000% of charges Maryland MD Vehicle Rental Sales Tax 11.500% of charges Massachusetts MA Consolidation Facility Charge Fee with Tax $6.38 per reservation per day MA Convention Center Financing Surcharge $10.00 per year since joining MA Police Training Fee $2.00 per reservation 12 hours or greater MA Revere Rental Surcharge $10.00 per year since joining MA Sales tax 6.250% of charges Michigan MI Sales Tax 6.000% of charges MI Wayne County Stadium Tax 2.000% of charges MI Sales Tax on Wayne County Stadium Tax 0.120% of charges Minnesota MN County Transit Sales Tax 0.500% of charges MN Hennepin County Sales Tax 0.150% of charges MN Mankato Sales Tax 0.500% of charges MN Minneapolis Airport Customer Facility Charge $7.18 per reservation per day MN Minneapolis City sales tax 0.500% of charges MN Motor Vehicle Rental Fee 3.000% of charges MN Motor Vehicle Rental Fee 5.000% of charges MN Motor Vehicle Rental Tax 9.200% of charges MN Sales Tax 6.875% of charges MN St. Paul City sales tax 0.500% of charges MN Transit Improvement Tax 0.250% of charges Missouri MO Boone County Sales Tax 1.750% of charges MO Cape Girardeau County Sales Tax 1.000% of charges MO Cape Girardeau Sales Tax 1.000% of charges MO Columbia Sales Tax 2.000% of charges MO Edmundson City Tax - Pear Tree Lane 3.750% of charges MO Edmundson City Sales Tax 1.750% of charges MO Greene County Sales Tax 1.750% of charges MO Jackson County Sales Tax 1.375% of charges MO Kansas City Airport Sales Tax 1.000% of charges MO Kansas City Airport CFC $3.28 per reservation MO Kansas City Rental Fee Plus Tax on Fee $0.54 per reservation per day less than 24 hours MO Kansas City Sales Tax 3.000% of charges MO KC Daily Rental Fee Plus Tax on Fee $4.34 per reservation per day 24 hours or greater MO Maryland Heights Sales Tax 0.500% of charges MO Platte County Sales Tax 1.375% of charges MO Springfield Sales Tax 2.125% of charges MO St. Louis County Sales Tax 3.390% of charges MO State Sales Tax 4.225% of charges MO Woodson Terrace City Sales Tax 1.750% of charges Mississippi MS County Vehicle Rental Tax 6.000% of charges MS Sales Tax 5.000% of charges Nebraska NE Douglas County Rental Tax 5.750% of charges NE Lancaster County Rental Tax 5.750% of charges NE Lincoln City Occupation Fee as Taxed 4.460% of charges NE Lincoln City Sales Tax 1.500% of charges NE Omaha Combined Occ & Sales Tax $8.92 per reservation 24 hours or greater NE Omaha City Sales Tax 1.500% of charges NE Omaha Short Term Occ & Sales Tax 4.460% of charges less than 24 hours NE State Sales Tax 5.500% of charges New Hampshire NH Meals & Rental Tax' 9.000% of charges New Jersey NJ Domestic Security Fee $5.00 per reservation per day NJ EWR Rental Tax 5.000% of charges NJ EWR Transportation Facility Charge $2.50 per reservation per day NJ State Sales Tax 6.625% of charges New Mexico NM Albuquerque Gross Receipts Tax 7.875% of charges NM Leased Vehicle Gross Receipts Tax 5.000% of charges NM Leased Vehicle Surcharge Tax $2.00 per reservation per day New York NY Albany County Sales Tax 8.000% of charges NY Broome County Sales Tax 8.000% of charges NY City/State Sales Tax 8.875% of charges NY Cortland County Sales Tax 8.000% of charges NY Dutchess County Sales Tax 8.125% of charges NY Erie County Sales Tax 8.750% of charges NY JFK Transportation Fee incl Tax $3.00 per reservation per day NY Livingston County Sales Tax 8% 8.000% of charges NY Madison County Sales Tax 8.000% of charges NY Monroe County (Rochester) sales tax 8.000% of charges NY Nassau County Sales Tax 8.625% of charges NY New Rochelle City Sales Tax 8.375% of charges NY Oneida County Sales Tax 8.750% of charges NY Onondaga County Sales Tax 8.000% of charges NY Ontario County Sales Tax 7.500% of charges NY Oswego County Sales Tax 8.000% of charges NY Passenger car rental tax 12.000% of charges NY Schenectady County Sales Tax 8.000% of charges NY St Lawrence County Sales Tax 8.000% of charges NY Suffolk County Sales Tax 8.625% of charges NY Ulster County Sales Tax 8.000% of charges NY Westchester County sales tax 8.375% of charges NY White Plains Sales Tax 8.375% of charges NY Yonkers Sales Tax 8.875% of charges Nevada NV Clark County Rental Fee 2.000% of charges NV Clark County Sales Tax 8.375% of charges NV Las Vegas Airport Customer Facility Charge $4.00 per reservation per day NV Short Term Rental Tax 10.000% of charges NV Washoe County Rental Tax 2.000% of charges NV Washoe County Sales Tax 8.265% of charges North Carolina NC Boone Rental Tax 1.500% of charges NC Chapel Hill Rental Tax 1.500% of charges NC Charlotte City Rental Tax 1.500% of charges NC County Transit Tax 5.000% of charges NC Cumberland County Rental Tax 1.500% of charges NC Davidson City Rental Tax 1.500% of charges NC Durham City Rental Tax 1.500% of charges NC Durham County Rental Tax 1.500% of charges NC Elon College Vehicle Rental Tax 1.500% of charges NC Fayetteville Rental Tax 1.500% of charges NC Forsyth County Rental Tax 1.500% of charges NC Greensboro Rental Tax 1.500% of charges NC Greenville Rental Tax 1.500% of charges NC Guilford County Rental Tax 1.500% of charges NC Harnett County Rental Tax 1.500% of charges NC High Point City Rental Tax 1.500% of charges NC Mecklenburg County Rental Tax 1.500% of charges NC Mecklenburg County U-Drive-It Rental Tax 5.000% of charges NC Motor Vehicle Lease and Rental Tax 8.000% of charges NC Orange County Rental Tax 1.500% of charges NC PART Privilege Tax 5.000% of charges NC Pitt County Rental Tax 1.500% of charges NC Raleigh City Rental Tax 1.500% of charges NC Wake County Rental Tax 1.500% of charges NC Watauga Rental Tax 1.500% of charges NC Winston-Salem Rental Tax 1.500% of charges Ohio OH - Central Ohio Transit Authority 0.250% of charges OH Athens County Sales Tax 1.250% of charges OH Cleveland Vehicle Lessor Tax $6.00 per reservation 4 hours or greater OH Cuyahoga County Sales Tax 1.250% of charges OH Cuyahoga County Transit Tax 1.000% of charges OH Franklin County Sales Tax 1.750% of charges OH Greene County Sales Tax 1.000% of charges OH Hamilton County Sales Tax 1.250% of charges OH Lucas County Sales Tax 1.250% of charges OH Montgomery County Sales Tax 1.750% of charges OH Portage County Sales Tax 1.500% of charges OH Stark County Sales Tax 0.750% of charges OH State Sales Tax 5.750% of charges Oklahoma OK Cleveland County Sales Tax 0.250% of charges OK Norman City Sales Tax 4.000% of charges OK Payne County Sales Tax 0.813% of charges OK State Rental Tax 6.000% of charges OK State Sales Tax 4.500% of charges OK Stillwater City Sales Tax 3.500% of charges Ontario CN Ontario HST 13.000% of charges Oregon OR Eugene Airport Customer Facility Charge $3.30 per reservation OR Lane County Rental Tax 10.000% of charges Pennsylvania PA Allegheny County Rental Vehicle Tax $2.00 per reservation per day PA Allegheny County Sales Tax 1.000% of charges PA Philadelphia County Sales Tax 2.000% of charges PA Philadelphia Vehicle Rental Tax 2.000% of charges PA PHL Airport Customer Facility Charge $8.00 per reservation per day PA Pittsburgh Airport Customer Facility Fee $3.27 per reservation per day PA Public Transportation Assistance Fund 4+ $2.00 per reservation per day 4 hours or greater PA Public Transportation Assistance Fund Less than 4 $1.25 per reservation per day less than 4 hours PA Sales Tax 6.000% of charges PA Vehicle Rental Tax 2.000% of charges Rhode Island RI Sales Tax 7.000% of charges RI Taxed Rental Surcharge 8.560% of charges RI TFGreen Airport Customer Facility Charge $6.93 per reservation per day South Carolina SC Charleston County Local Tax 3.000% of charges SC Horry County Local & Capital Improvement Tax 2.000% of charges SC Myrtle Beach Airport Customer Facility Charge $4.46 per reservation per day SC Myrtle Beach Tourism Development Tax 1.000% of charges SC Pickens County 1.000% of charges SC Sales Tax 6.000% of charges Tennessee TN Alcoa Sales Tax 2.750% of charges TN Auto Rental Surcharge 3.000% of charges TN Davidson County Rental Surcharge 1.000% of charges TN Davidson County Sales Tax 2.250% of charges TN Franklin County Sales Tax 2.250% of charges TN Knox County Sales Tax 2.250% of charges TN Memphis Airport - Customer Facility Fee $4.59 per reservation per day TN Nashville Airport Customer Facility Charge $5.10 per reservation per day TN Nashville Airport transaction fee $2.00 per reservation TN NBA Arena Tax 2.000% of charges TN Shelby County Sales Tax 2.750% of charges TN State Sales Tax 7.000% of charges Texas TX AUS Customer Facility Charge incl Tax $6.84 per reservation per day TX Austin MTA Tax 1.000% of charges TX Austin Rental Tax 5.000% of charges TX Bexar County Rental Tax 5.000% of charges TX El Paso Rental Tax 5.000% of charges TX Harris County Rental Car Tax 5.000% of charges TX IAH Customer Facility Charge Fee $4.60 per reservation per day TX Mclennan County Sales Tax 0.500% of charges TX Motor Vehicle Rental Tax 10.000% of charges TX San Antonio Airport Customer Facility Charge $5.75 per reservation per day TX State Sales Tax 6.250% of charges TX Arlington City Rental Tax 5.000% of charges Utah UT Salt Lake County Rental Tax 7.000% of charges UT Salt Lake County Sales Tax 2.400% of charges UT State Rental Tax 2.500% of charges UT State Sales Tax 4.850% of charges Vermont VT Rental Company Tax 9.000% of charges Virginia VA DMV Rental Fee 2.000% of charges VA Local Vehicle Rental Tax 4.000% of charges VA Motor Vehicle Rental Tax 4.000% of charges Washington WA Bellevue Sales Tax 3.600% of charges WA Bellingham City Sales Tax 2.200% of charges WA Ellensburg City Sales Tax 1.800% of charges WA Kitsap County Sales Tax 2.600% of charges WA Kittitas County Rental Tax 6.900% of charges WA Pullman Sales Tax 1.300% of charges WA Redmond Sales Tax 3.600% of charges WA Renton City Sales Tax 3.600% of charges WA Seatac Local Sales Tax 3.600% of charges WA Seattle Sales Tax 3.600% of charges WA Spokane City Sales Tax 2.400% of charges WA Spokane County Rental Tax 6.900% of charges WA State Rental Car Tax-Pierce County 7.700% of charges WA State Rental Car Tax - Bainbridge Island 5.900% of charges WA State Rental Car Tax - Clark County 5.900% of charges WA State Rental Car Tax - King County 7.700% of charges WA State Rental Tax - Thurston County 5.900% of charges WA State Rental Tax - Whatcom County 5.900% of charges WA State Rental Tax - Whitman County 5.900% of charges WA State Sales Tax 6.500% of charges WA Tacoma City Sales Tax 3.700% of charges WA Thurston County PBTA Sales Tax 2.700% of charges WA Vancouver Sales Tax 1.900% of charges Washington, DC DC Rental Sales Tax 10.250% of charges Wisconsin WI Center Local Exposition Car Rental Tax 3.000% of charges WI Dane County Sales Tax 0.500% of charges WI Milwaukee County Sales Tax 0.500% of charges WI Rental Vehicle Fee 5.000% of charges WI State Sales Tax 5.000% of charges West Virginia WV Daily Rental Tax $1.00 per reservation per day WV Sales Tax 6.000% of charges", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/220333628-Is-there-a-damage-fee-if-I-damage-a-Zipcar-vehicle", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/220333628.json", "title": "Is there a damage fee if I damage a Zipcar vehicle?", "last_updated": "2025-02-28T16:27:17Z", "section_id": 4415790262035, "body": "If you happen to be involved in an incident with your Zipcar, a damage fee of up to $2,500 may apply. A damage fee can apply to dents, scratches, collisions, flat tires, windshield cracks, dead batteries, engine problems, vandalism, or theft of a Zipcar. Members are not responsible for normal wear-and-tear on the vehicle. However, the fee does apply to damage to a Zipcar vehicle caused by unavoidable events such as floods, hail, wind, trees falling, etc. Before each trip, we ask you to check the car inside and out and report any damage. This ensures that you will not be held responsible for damage that may have happened before your reservation. Damage protection plans can be purchased to reduce or eliminate your financial responsibility for damages to the Zipcar vehicle, in some circumstances.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/220333648-Does-my-credit-card-rental-car-insurance-coverage-apply-to-Zipcar", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/220333648.json", "title": "Does my credit card rental car insurance coverage apply to Zipcar?", "last_updated": "2024-04-19T21:26:08Z", "section_id": 4415790262035, "body": "Some credit cards include rental car insurance . Zipcars may fall under this coverage depending on your credit card provider. To confirm, contact your credit card provider to confirm Zipcar is included in their rental coverage, and to what extent. If your credit card provider does offer applicable coverage, be sure to use it to pay for your booking. You can find more information on updating your payment information here .", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/220333688-How-do-I-change-the-damage-protection-coverage-for-drivers-on-my-account", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/220333688.json", "title": "How do I change the damage protection coverage for drivers on my account?", "last_updated": "2024-04-25T05:13:16Z", "section_id": 360004537873, "body": "As an admin of a family account, you can manage your damage protection coverage, as well as the coverage plans of any drivers on your account by following the below steps: Sign in to your Zipcar account Click on My Account at the top of the page and select Account Settings Select the People tab Click the overflow menu (3 vertical dots) next to the driver you would like to update Select Update protection Choose the damage protection coverage that you prefer and select Update protection Repeat the above steps for each driver, including yourself, that you would like to update the damage protection coverage for. Keep In Mind Only admins of a family account can update damage protection coverage", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/220333808-Am-I-eligible-to-join-Zipcar", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/220333808.json", "title": "Am I eligible to join Zipcar?", "last_updated": "2025-08-26T15:02:32Z", "section_id": 4415725357075, "body": "To join Zipcar's membership program, certain eligibility requirements must be met. Before applying, review the below requirements to be considered for membership in our car-sharing community. Driving License Requirements: Licenses must be valid, unexpired, and government-issued Licenses without photographs of the driver may warrant the request for additional legal identity documents Instructional permits, learner's permits and paper licenses are not accepted, including international licenses of these types Licenses which require supplementary documents for validity are not accepted Photocopied, digital, and temporary licenses are not accepted Canadian G1 licenses are not accepted Non-US licenses may warrant the request of additional legal identity documents Age Requirements: Applicants joining a consumer (family) or business account must be 21+ years old (or 18+ if residing in New York, Michigan, or Maryland) Applicants joining a university account must be 18+ years old Driving History Requirements: Incidents and violations may be grounds for rejection from membership Applicants in Michigan under the age of 21 must have no major violations or incidents, including excessive speeding, operating to endanger, reckless driving, leaving the scene of an accident involving property damage, operating a motor vehicle with a suspended or revoked license, and speeding in a school zone (or similar events) Applicants will be required to accept the terms and conditions of the member application and member agreement. Note Meeting the above requirements does not guarantee access to Zipcar's membership program. Membership may be denied or terminated at Zipcar’s sole discretion.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/220333888-How-do-I-book-a-Zipcar", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/220333888.json", "title": "How do I book a Zipcar?", "last_updated": "2024-04-20T10:28:48Z", "section_id": 115000306187, "body": "Booking a Zipcar is a breeze and can be done from the web or from the Zipcar app on iPhone ® or Android ™. Sign in to your Zipcar account From the Book a car page, input your search criteria Hit Search Select the car that meets your needs Drive worry-free by purchasing insurance (optional) Click Book this car Tips You can filter the type of vehicle & model when viewing the search results If you want to include unavailable cars in your search results, select My time is flexible on the results page", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/220334248-How-do-violations-citations-work-with-Zipcar", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/220334248.json", "title": "How do violations & citations work with Zipcar?", "last_updated": "2024-05-01T15:04:46Z", "section_id": 4415635273491, "body": "Members are responsible for legal infractions such as traffic violations and parking citations. If Zipcar receives notice of a violation during (or in some cases, following) your trip, you will be charged a $30 processing fee in addition to the original cost of the ticket. How do I pay for it? If Zipcar has already paid the citation, you will receive a charge to your credit card for the cost of the ticket (plus a processing fee), which will be available for review on the billing page . If Zipcar has not yet paid the citation (typically in cases where a physical citation is left on the vehicle for you), you will be responsible for settling the ticket with the issuing municipality directly. Please follow their payment options accordingly. While you are not the owner of the vehicle and the ticket may not be in your name, you will still be responsible for the ticket. What if I don't pay it? If you do not pay a ticket, we will be notified and charge you a $30 processing fee. Additionally, you are responsible for the cost of the ticket including any late fees and we will bill the total to your account. Other fines or membership suspension can also occur if the ticket is not paid on time. Can I dispute it? If you wish to contest a violation and the issuing municipality allows it, please do so promptly. If we receive a notice in the mail and you have yet to dispute the ticket with the issuing municipality, we will automatically bill your account for the amount of the violation, plus the processing fee. Keep In Mind In most cases, once Zipcar has paid the citation and charged your account, the timeframe to raise a dispute with the issuing municipality has expired or is otherwise no longer an available option", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/220432007-How-do-I-update-my-payment-method-on-my-wallet", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/220432007.json", "title": "How do I update my payment method on my wallet?", "last_updated": "2024-06-07T21:54:59Z", "section_id": 115000306327, "body": "Add a payment method Mobile: Go to the Account tab at the bottom right of your Zipcar Mobile App Click on the Wallet tab in your Account Settings Under payment methods, select Add a Payment Method Enter your card information on the next screen Select Confirm Payment to add your card. Website: Go to the My Account tab at the top right of the website Click on the Wallet tab Next to payment methods, select Add a Payment Method Enter your card information on the next screen Select Confirm Payment to add your card. Remove a payment method Mobile: Go to the Account tab at the bottom right of your Zipcar Mobile App Click on the Wallet tab in your Account Settings Please select the payment method you want to remove. Note: You must have at least one payment method on file as your default Once the next screen pops up, select Remove Confirm you want to remove this payment method by selecting Remove again Website: Go to the My Account tab at the top right of the website Click on the Wallet tab Select the overflow menu on the payment method you would like to remove Choose Remove and you should see the payment method updated as the default in your wallet Keep In Mind If you have backup payments enabled, you agree to let Zipcar charge your alternative payment methods if a payment fails. More information on backup payments can be found here You may add up to 10 payment methods to your wallet You can manage your payment methods by going to the Zipcar Mobile App or by visiting your account settings on the Zipcar Website Refunds for trip or membership charges can only be returned to the card originally used for the purchase Only admins and owners of an account can update the payment information Accepted forms of payment in the US are credit and debit cards Accepted forms of payment in Canada are credit and Visa debit cards", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/220433387-What-is-the-basic-insurance-coverage-Zipcar-provides", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/220433387.json", "title": "What is the basic insurance coverage Zipcar provides?", "last_updated": "2025-02-28T16:24:45Z", "section_id": 4415790262035, "body": "Members who comply with the membership contract are covered by Zipcar physical damage insurance on the Zipcar vehicle while driving a Zipcar. In the case of an incident, members are responsible for a damage fee of up to the first $2,500 of damage to the Zipcar vehicle, and all further Zipcar vehicle damage is covered by Zipcar insurance. The damage fee can be reduced or eliminated with the purchase of optional damage protection coverage . Zipcar insurance also includes secondary third-party liability coverage and, where required, Personal Injury Protection (PIP) or \"no-fault\" coverage. All third-party liability and PIP coverage meets the minimum requirements of the state or jurisdiction in which an accident occurs, and coverage is only available after a member has exhausted any other applicable coverage. To see the details of your third-party liability coverage, please read the \"Third Party Liability\" section of the Zipcar membership contract . Keep In Mind Coverage may be provided under a certificate of self-insurance, insurance policy, or both Members who joined Zipcar on a plan affiliated with a business, university, or other entity may have different insurance coverage than what is described above For accident claims in Canada, members who comply with the membership contract will be protected against liability for causing bodily injury or death to others, or damaging the property of someone other than the driver and/or renter up to the minimum financial responsibility limits required by the laws of the jurisdiction in which the accident occurs, plus provincial minimum levels for other statutorily required coverages, and are subject to all its terms, conditions, and exclusions. Except where required by law to be primary, any protection provided by us shall be secondary to, and not in excess of, any applicable insurance available to you, or any other driver.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/220622647-Where-should-I-park-my-Zipcar-at-the-end-of-my-trip", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/220622647.json", "title": "Where should I park my Zipcar at the end of my trip?", "last_updated": "2024-03-17T02:14:34Z", "section_id": 115000314548, "body": "Zipcar is a roundtrip service. Your Zipcar should always be returned to the home location the vehicle belongs to (this is where you picked the vehicle up from unless otherwise advised) at the end of your trip. If you're dropping off at a location that has more than one Zipcar space, any of them will do.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/220623087-How-do-I-end-my-Zipcar-trip", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/220623087.json", "title": "How do I end my Zipcar trip?", "last_updated": "2024-04-03T17:19:33Z", "section_id": 115000314548, "body": "Once you're done with your trip, you can end your booking to make the car available to be booked by others. Before you do that, here are some things to keep in mind: Make sure the car has at least 1/4 tank of gas Clean out the car - it should be as clean as (or cleaner than) you found it Return the car to the home location it belongs to (if the location has more than one Zipcar spot, any will do) Make sure the ignition is off and the keys are removed from the ignition cylinder Close all the doors Lock the car using your Zipcard or iPhone ® or Android ™ mobile app Take End-Trip pictures to let us know you left the car in the same condition as when your trip started To end your Zipcar trip, follow the steps below: Open your Zipcar iPhone ® or Android ™ mobile app Click Drive from the menu Select End Trip Follow prompts and take pictures Keep In Mind Unused time is not refundable If you don't manually end your trip, it will end automatically", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/220623127-Am-I-able-to-return-my-Zipcar-early", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/220623127.json", "title": "Am I able to return my Zipcar early?", "last_updated": "2024-03-23T15:49:51Z", "section_id": 115000314548, "body": "Yes, you are always welcome to return your Zipcar and end your trip early. Ending your trip will make the car available to be booked by others. Learn more about ending your trip here . Keep In Mind Unused time is not refundable", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/220623207-Is-mileage-included-with-my-Zipcar-trip", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/220623207.json", "title": "Is mileage included with my Zipcar trip?", "last_updated": "2025-12-08T16:30:13Z", "section_id": 115000306187, "body": "Yes, in most cases, some mileage is included with your Zipcar trip. There's never a limit on how far you can drive your Zipcar, but there is a limit on how many of those miles are included with your reservation. U.S. Mileage: Lite: 50 free miles per 24 hours, plus 20 extra miles for each additional hour (up to 50 miles/day). Standard: 200 free miles per 24 hours, plus 20 extra miles for each additional hour (up to 200 miles/day). Plus: 300 free miles per 24 hours, plus 20 extra miles for each additional hour (up to 300 miles/day). Canada Mileage: Lite: 50 free kilometers per 24 hours, plus 20 extra kilometers for each additional hour (up to 50 km/day). Standard: 200 free kilometers per 24 hours, plus 20 extra kilometers for each additional hour (up to 200 km/day). Plus: 300 free kilometers per 24 hours, plus 20 extra kilometers for each additional hour (up to 300 km/day). Additional Mileage Charges: Any mileage over the included amount is billed at $0.67 per mile (U.S.) or $0.67 per kilometer (Canada). Keep In Mind Your mileage isn't limited per day if you book for multiple days. So, if you have 400 included miles, you can drive as many miles as you'd like anytime during your booking. At the end, if your total mileage is greater than your included miles you'll be charged the above rates per mile. University plans include 180 miles (U.S.) or 180 kilometers (Canada) per 24-hour period. Some pay-per-mile cars and membership plans may include varying miles with each reservation.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/220623227-Are-there-any-fees-if-I-cancel-or-shorten-my-booking", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/220623227.json", "title": "Are there any fees if I cancel or shorten my booking?", "last_updated": "2025-02-11T17:39:07Z", "section_id": 4415635273491, "body": "As long as any changes to your trip are made with enough advance notice, no additional charges or fees will be applied, and you will receive a refund for the change or cancellation. To ensure you receive the full refund amount, be sure to modify your booking within the following timeframes: Within 30 minutes of creating a trip Up to 3 hours before the start time (for trips less than 8 hours in length) At least 24 hours in advance (for trips 8 hours or greater in length) Cancellations or shortened bookings made outside of the above timeframes will be ineligible for a refund. Keep In Mind If you need to modify your booking, rates are honored for 1 month before and after your original trip Early returns cannot be credited for time unused You can extend your ongoing trip if no existing trips immediately following yours", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/220675907-What-are-the-various-fees-charges-I-might-incur", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/220675907.json", "title": "What are the various fees & charges I might incur?", "last_updated": "2025-12-03T19:06:44Z", "section_id": 4415635273491, "body": "In addition to the cost of Zipcar membership and standard driving rates , other fees and charges may apply. See below for details. Application Fee A one-time $25 application fee is applied when a driver applies for membership. This fee offsets costs for pulling driving records and reviewing and approving applications. The application fee is non-refundable and is charged whether or not the driver is approved for membership. Booking Change or Cancellation Fee There is no charge if you cancel or shorten your reservation with the required advance notice, but if you don't cancel or shorten within the required timeframe, you're responsible for the full amount of the reservation. The required notice is located on your reservation confirmation. Learn more about changing and cancelling a reservation . Business Account Setup Fee A one-time $75 account setup fee is applied when creating a business account. This fee offsets costs for account setup. The account setup fee is non-refundable. Specific membership plans and promotions may waive the account setup fee. Cleaning & Other Violation Fees General Cleanliness Fee: $50 per violation, plus costs incurred by Zipcar anytime a visit to the vehicle is required (examples include: trash left in car or pet hair). Smoking Cleanliness Fee: $150 per violation. Damage Fee Up to $2,500 to cover the costs related to an accident. Key Replacement Fee The cost of the replacement key if you lose the key. Late Return Fee $50 per hour (up to a maximum of $150), plus the extra time you used the car. Low Fuel Fee $30 if you return a vehicle with less than 1/4 tank of gas. Market/Regional Fees & Taxes Depending on where you live, local fees and taxes may also be applied to the cost of your trip. Learn more about local taxes . Mileage Fee Most trips come with up to 200 miles (or 200km) included per 24-hour period, with 20 additional miles (15 km) for each additional hour (until up to 200 miles, or 200km, is reached). All additional mileage will be billed at $0.67/mile ($0.67CAD/km) upon completion of your trip. Some pay-per-mile cars or membership plans only include up to 180 miles or do not include free mileage. Parking Pass Replacement $225 if you lose or remove the parking pass from the Zipcar. Retrieval Fee You will be charged a flat fee at minimum if you do not return the Zipcar vehicle back to its home location by the end of your trip. $275 - New York market $250 - All other markets Roadside Assistance Fee A flat fee at minimum for roadside assistance due to member error such as running out of gas. $275 - New York market $250 - All other markets Tickets/Violation Processing Fee You are responsible for paying any parking tickets and moving violations incurred during your reservation. If we receive a notice and process a violation, a $30 processing fee will be assessed. Toll Charges All toll charges will be billed to your account after the trip ends. It may take a few weeks for Zipcar to learn of the tolls from the municipality, so it may take some time for the charges to appear. Learn more about our toll passes and policies . Towing and Storage Fee You are responsible for the cost of towing and storage if your reserved Zipcar is towed during your reservation or within 24 hours of the conclusion of your reservation due to illegal parking. Young Driver Fee A young driver fee applies to individuals between 18 and 24 years old when booking a trip within the United States and varies by location and renter age. The fee does not apply for trips started after a member turns 25. New York locations: Fees start at $4.50 per hour or $35.00 per day All other locations: Fees start at $3.50 per hour or $28.00 per day University members can access on-campus cars at lower rates: New York locations: Fees start at $2.25 per hour or $17.50 per day All other locations: Fees start at $0.75 per hour or $6.00 per day Zipcard Replacement Fee One free replacement card per year ($15 for each additional card). Learn more about your Zipcard .", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/220675927-How-do-I-file-tax-exemption-for-myself-or-business", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/220675927.json", "title": "How do I file tax exemption for myself or business?", "last_updated": "2023-03-06T02:02:59Z", "section_id": 115000306327, "body": "Some businesses (and in rare cases, individuals) may be eligible for tax exemption. If you or your business is tax exempt, please email business@zipcar.com a copy of a state-issued exemption certificate . Keep In Mind The name and address on the tax exemption certification must match the information on your Zipcar account", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/220676007-I-got-into-an-accident-what-should-I-do", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/220676007.json", "title": "I got into an accident, what should I do?", "last_updated": "2025-05-28T19:57:54Z", "section_id": 4415790262035, "body": "First and foremost, we hope you're safe. If you're involved in an accident, please follow these steps once it is safe to do so: Ensure your safety: Move to a safe location. Document the scene: Take clear photos of all damage and the accident surroundings. Contact the authorities: If required by local law, contact the police to file an official accident report. Always call 911 if the third party does not stop or if a tow is needed. Members are required to exchange information with any third party involved in the accident. Gather necessary information: Collect all details outlined in Section 7.4 of the Rules of Vehicle Use: ○ Date, time, and location of the incident ○ License plate, make, model year, VIN, and insurance info of all vehicles involved ○ Third Party's contact details ○ Contact information for witnesses, passengers, and others involved ○ Brief summary of the incident ○ Police report (if required) Notify Zipcar: Call us immediately at 866-4ZIPCAR (866-494-7227) to report the incident. Complete an incident report: After your call, you’ll receive an email and a text message with a link to submit a full incident report. Here are some things to know or keep in mind as we process the accident report: Account Status: Your Zipcar account will be suspended while we await your incident report. Once we receive your report, we will review your account and provide an update on your suspension within 3 business days. Vehicle Inspection: Zipcar will assess the vehicle for any damage and arrange for necessary repairs. More Information: For more information about the accident process, please refer to I was in an accident. What should I expect during the accident process?", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/220676147-How-do-I-sign-up-for-a-new-personal-family-account", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/220676147.json", "title": "How do I sign up for a new personal/family account?", "last_updated": "2024-04-10T06:44:14Z", "section_id": 115000305987, "body": "To sign up for a Zipcar personal/family account, follow the steps below to submit your application: Find a plan that works for you on our membership pricing page Input your name, email address and password to create your account Follow the steps to upload your driver's license and take a selfie to verify your identity Input your billing information Submit your application Keep In Mind Most applications are instantly reviewed and approved or rejected In some cases, it may take several business days to fully review the application, and more information may be requested", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/220676207-How-do-I-create-a-business-account", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/220676207.json", "title": "How do I create a business account?", "last_updated": "2022-07-20T20:32:27Z", "section_id": 115000305987, "body": "To submit an application to join Zipcar through your business, follow the steps below: Find and select a business plan on our business pricing page Input your personal & business information Follow the steps to upload your driver's license and take a selfie to verify your identity Note: This step is optional and only if you want to also be a driver of the account. You can always do this later if you skip this step Input your billing information Submit your application Note: This step only applies if you are submitting an application to drive Once you have created your business account, begin inviting drivers to join your account . Keep In Mind Large-scale businesses can apply for an Enterprise Membership Residential businesses can apply for a Residential Membership Most applications are instantly reviewed and approved or rejected In some cases, it may take several business days to fully review the application and more information may be requested All membership & driving-related fees of drivers on a business account will be charged to the business credit card on file", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/220676227-Is-there-a-maximum-or-minimum-booking-length", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/220676227.json", "title": "Is there a maximum or minimum booking length?", "last_updated": "2024-04-22T18:15:24Z", "section_id": 4415635273491, "body": "You can book a Zipcar for as little as one hour or as long as 14 days at a time. Bookings can be made in half-hour increments. When booking, keep in mind that the Zipcar you booked is available for others to reserve before and after your reservation. Make sure to give yourself enough time so that you don't impact another member's trip if you get caught in traffic.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/220676347-How-do-hourly-daily-rates-work", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/220676347.json", "title": "How do hourly & daily rates work?", "last_updated": "2024-04-16T14:54:11Z", "section_id": 115000306187, "body": "Hourly & Daily Rates Most vehicles have hourly and daily rates which vary by day of the week. When booking a vehicle, the hourly rate will be charged up to the daily rate of the vehicle, which is the maximum rate for a 24-hour period. Sometimes, it will be cheaper to pay the daily rate versus the hourly rate, even if you're booking a vehicle for less than a whole day. We'll do the math and quote you the least expensive rate. Hourly-Only Vehicles Some vehicles are hourly-only, meaning there is no daily rate available. These cars can be booked by the hour and do not have a daily maximum rate for a 24-hour period. Flat Rate Only Vehicles Some vehicles have a flat rate booking option only, meaning there is no hourly rate available. You can find Flat Rate Only vehicles by looking for the blue label when going to book. More information about how this pricing works can be found here. Keep In Mind Hourly and daily rates may vary over time due to discounts, availability, holidays, or other factors. Other fees may apply .", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/220676487-Who-is-allowed-to-drive-my-Zipcar-during-my-trip", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/220676487.json", "title": "Who is allowed to drive my Zipcar during my trip?", "last_updated": "2024-02-08T00:28:43Z", "section_id": 115000306307, "body": "Only active members are allowed to drive Zipcars. If you have a family account, other drivers on your account are authorized to drive the Zipcar. If a Zipcar member on a different account is driving the Zipcar you reserved, we ask you be along for the ride. All fees and charges , as well as damage fees , will be the responsibility of the reserving member. Keep in Mind Allowing non-members to drive your Zipcar would be a breach of the membership contract and may result in termination of membership", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/220676507-How-do-I-pickup-my-Zipcar-from-a-parking-garage-with-a-valet", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/220676507.json", "title": "How do I pickup my Zipcar from a parking garage with a valet?", "last_updated": "2024-01-08T00:03:26Z", "section_id": 115000306287, "body": "Some Zipcars are located in garages with valets and attendants who park and retrieve cars. Upon arriving at the garage, inform the attendant of which Zipcar you are picking up. Once the car is brought out to you, the attendant will need to close and lock the car before you are able to begin your trip . To begin your trip, use your Zipcard or unlock the car from your iPhone ® or Android ™ app.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/220676647-What-are-the-cleanliness-community-rules", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/220676647.json", "title": "What are the cleanliness community rules?", "last_updated": "2024-04-11T07:50:55Z", "section_id": 360004492634, "body": "Zipcars are regularly inspected and cleaned, but we rely on our car sharing community to keep vehicles clean for others, and to let us know when cars need to be tidied up. Here are some cleaning expectations we have: Return the car as clean as (or cleaner than) you found it (inside and out) Let us know if a car is not as clean as you'd expect at the beginning of your trip (report through the Zipcar iPhone ® or Android ™ mobile app) No smoking, ever! Pets must be kept in locked carriers", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/115001108487-What-happens-if-I-return-late", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/115001108487.json", "title": "What happens if I return late?", "last_updated": "2024-03-30T21:56:35Z", "section_id": 115000314548, "body": "It’s important to return on time, as you could impact the next member’s trip. If you’re running late, you’ll be charged for the extra time you used the car, plus an additional late fee: 1- 60 minutes late: $50 ($50 CAD) 61–120 minutes late: $100 ($100 CAD) 121+ minutes late: $150 ($150 CAD) To avoid returning late: Book your trip well in advance while the car still has plenty of availability Take traffic into account and book enough time to complete your trip, refuel if below 1/4 tank, and clean out the car before ending your trip If the car is available, extend your trip from the “drive” screen in the app Turn on push notifications to receive trip status updates Keep In Mind Please call us at 866-4ZIPCAR if you are unable to return the car on time If you receive 3 late fees within a 12-month period, Zipcar will review your account and may suspend or end your membership", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/115001123948--How-can-I-reactivate-my-membership", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/115001123948.json", "title": " How can I reactivate my membership?", "last_updated": "2024-04-24T20:37:01Z", "section_id": 360004537873, "body": "If you have recently cancelled your membership, your account will not be deactivated until the end of your current membership cycle. If your account is still scheduled for deactivation at a future date, you are able to un-cancel the request. If your membership has already been canceled, you can reactivate by following the steps below: Sign in to your Zipcar account Click on My Account at the top of the page and select Account Settings Click the Plan card Select Reactivate membership Keep In Mind If it has been more than 90 days since your account was deactivated, you will be prompted to submit a new application to have your account reactivated, and an application fee may be charged", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/115001138188-Is-gas-included-with-my-Zipcar-trip", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/115001138188.json", "title": "Is gas included with my Zipcar trip?", "last_updated": "2024-04-29T19:17:48Z", "section_id": 115000306187, "body": "Yes! Every Zipcar has a fuel card in the visor above the driver's seat that can be used when purchasing fuel. Keep in mind, Zipcar is a car sharing community. Please return your Zipcar with at least 1/4 tank of gas at the end of your trip, no matter how much it had at the start. If you're having issues with the fuel card, or if it is missing, click here .", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/115004485287-Can-I-use-a-Zipcar-for-my-driving-test", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/115004485287.json", "title": "Can I use a Zipcar for my driving test?", "last_updated": "2024-04-23T23:04:16Z", "section_id": 360004492634, "body": "No, the use of Zipcars for driving tests is prohibited, as noted in the membership contract . Failure to adhere to the rules of vehicle use may result in termination of membership.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/115004485367-Can-I-drive-my-Zipcar-outside-of-the-country", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/115004485367.json", "title": "Can I drive my Zipcar outside of the country?", "last_updated": "2024-01-31T13:23:35Z", "section_id": 4415635273491, "body": "Zipcars can be freely driven between the United States and Canada and no additional documentation is needed. Keep mileage in mind if you’re planning on a lengthy trip. Zipcars cannot be driven outside of the US or Canada . Violation of this policy will result in termination of the Zipcar membership.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/115004650748-What-out-of-pocket-expenses-are-eligible-for-reimbursement", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/115004650748.json", "title": "What out of pocket expenses are eligible for reimbursement?", "last_updated": "2024-07-15T17:36:10Z", "section_id": 115000306327, "body": "Certain out of pocket expenses incurred during your Zipcar trip may be eligible for reimbursement. With the exception of fuel expenses, always be sure to give us a call to have the expense authorized before making your purchase . Eligible reimbursement expenses: Fuel - In the event the fuel card in your Zipcar does not work or is missing, we'll reimburse the cost of fueling up the car (but please be sure to report the fuel card issue via our mobile app so our team can look into it) Wiper Fluid - Up to $10 if your Zipcar is low on wiper fluid Wiper Blades - The cost of standard wiper blades if your Zipcar's blades are no longer fully functional Reimbursements are typically not offered for vehicle care expenses, including tire changes, new batteries, oil changes, and other services. For more information or support, please give us a call. Keep in Mind Requests must be submitted within 30 days of purchase Receipt images must clearly show the date, time, and amount of purchase Fuel receipts must show the final charge amount and gallons (or liters) and not a pre-authorized amount A screenshot or downloaded copy of your bank statement or posted bank statement can be submitted if you have lost the receipt Hand-written or digitally altered receipts are not accepted Uber Drivers are not eligible for fuel reimbursements Submit a Reimbursement Request", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/115011178628--How-can-I-reset-or-change-my-password", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/115011178628.json", "title": " How can I reset or change my password?", "last_updated": "2024-03-29T21:50:19Z", "section_id": 360004537873, "body": "If you are able to login to your Zipcar account: Sign in to your Zipcar account Click on My Account at the top of the page and select Account Settings Select the Password card Input your new password and select Update password If you are unable to login to your Zipcar account: Go to the Zipcar sign in page Select Forgot password? Input your email address Follow the password reset instructions sent to your email address", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/115012010647-Can-I-join-with-a-non-US-driver-s-license", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/115012010647.json", "title": "Can I join with a non-US driver's license?", "last_updated": "2023-12-25T17:51:24Z", "section_id": 4415725357075, "body": "Yes, international driver's licenses may be accepted when applying to join Zipcar. For more information on our eligibility requirements, including driving license requirements, click here.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/115012165008-How-can-I-check-the-status-of-my-application", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/115012165008.json", "title": "How can I check the status of my application?", "last_updated": "2024-03-27T18:51:41Z", "section_id": 4415725357075, "body": "We are eager to get you on the road as quickly as possible, and most members are approved and can book in minutes. If you would like to check the status of your recently submitted application, please sign in to your account here . If your application has not been approved, a banner will be at the top of the page. Here are the more common states your application might be in: Application In Review Though most applications are decisioned quickly, it can sometimes take several business days if more information or review is needed Application Incomplete If you haven't completed and submitted your application, follow the link to complete the remaining steps Application Rejected In some cases, applications may be rejected from membership Tip Has it been a few days since you've completed your application? Hit the contact us button to get in touch.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/360001443027-How-do-I-cancel-my-membership", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/360001443027.json", "title": "How do I cancel my membership?", "last_updated": "2025-05-01T19:23:45Z", "section_id": 360004537873, "body": "Did You Know? You can pause your monthly membership for up to three months, allowing you to take a breather without saying goodbye. For more information, check out this article ! Log in to your Zipcar account on the website or mobile app Go to My Account and click on your membership plan Click Cancel Membership You'll then be prompted to pause your membership for up to three months - Click Cancel Membership Finally, Cancel Membership once more, and you should see a screen confirming the cancellation Here are some things to keep in mind when canceling your Zipcar membership: Once your membership has been canceled, you may continue to book cars until the end of your billing cycle If you have a Family Plan, the memberships of all drivers on your account will be canceled as well, but they can book cars until the end of your billing cycle Any trips scheduled after your plan expires will be canceled If you have a remaining balance on your account, it will be charged or credited to your credit card on file when your account is canceled Additional trip costs, tolls, and violations will be charged once they are received If you change your mind and would like to resume your membership, you can reactivate your membership", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/360001630448-Are-hand-controlled-vehicles-available-for-members-with-disabilities", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/360001630448.json", "title": "Are hand-controlled vehicles available for members with disabilities?", "last_updated": "2023-09-29T02:20:41Z", "section_id": 115000306187, "body": "Yes, we work to make hand-controlled vehicles available to our members who require them. It often takes a bit of time for us to find suitable vehicles and have the hand-controls installed, so we ask for a minimum of 72-hours notice if you require this service. Give us a call and our team will work to accommodate.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/360001753768-How-do-I-update-my-phone-number", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/360001753768.json", "title": "How do I update my phone number?", "last_updated": "2025-04-04T15:12:14Z", "section_id": 360004537873, "body": "Note To update the phone number on your account, you will need access to the following: The new phone number you would like to connect to your account The phone number connected to your account You can update your phone number by following the steps. Sign in to your Zipcar account Click into your account and navigate to Personal Info or Account Settings Select Phone Input the new phone number Confirm your verification method and select Update Input the verification code sent via SMS to the phone number on file Input the verification code sent via SMS to the new phone number Keep In Mind If Optimum is your service provider, you may not receive verification codes. Use the form below to reach out for assistance. If your phone number is inaccessible, please look at this article for steps to recover access to your Zipcar account. Submit a Support Request", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/360001770547-How-do-I-update-my-email-address", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/360001770547.json", "title": "How do I update my email address?", "last_updated": "2024-04-19T19:16:33Z", "section_id": 360004537873, "body": "Note To update the email address on your account, you will need access to the following: The email inbox currently associated with your Zipcar account Access to the phone number connected to your account You can update your email address by following the steps. Sign in to your Zipcar account Click into your account and navigate to Personal Info or Account Settings Select Email Input the new email address Confirm your verification method and select Update Input the verification code sent via SMS to the phone number on file Input the verification code sent via email to the new email address Keep In Mind If your phone number is inaccessible, please look at this article for steps to recover access to your Zipcar account.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/360001881688-How-can-I-update-my-notification-settings", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/360001881688.json", "title": "How can I update my notification settings?", "last_updated": "2023-10-14T07:34:15Z", "section_id": 360004537873, "body": "Managing notification preferences in the Zipcar mobile app: To turn on text messages and/or push notifications or receive emails from Zipcar on your mobile app, follow the steps below: Navigate to your app home screen and select account Scroll down and select Notification settings On the Notifications screen, use the toggles to modify your notification preferences Managing notification preferences in a web browser: To turn on text messages and/or push notifications or receive emails on a web browser, follow the steps below: Sign in to your account Click on My Account at the top of the page and select Account Settings Select the Notifications card Use the toggles to configure your notification preferences and select Update notifications", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/360019940614-Why-was-my-Zipcar-booking-moved-to-another-car-or-cancelled", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/360019940614.json", "title": "Why was my Zipcar booking moved to another car or cancelled?", "last_updated": "2024-04-15T04:56:47Z", "section_id": 4415635273491, "body": "Why did Zipcar move my booking? When unforeseen car, location, or member issues arise, we must occasionally move a member to a vehicle other than the one originally reserved. We understand how disruptive this can be and work to notify our members of the adjustment as soon as we become aware of an issue. When your reservation is moved due to issues outside of your control you will always pay the lower price between the two vehicles . Some things we prioritize when moving reservations: Timeframe Keep the same start time, end time, and location of the reservation Vehicle Type If a specialized vehicle is reserved, such as a Zipvan, we will always try to move the booking into the same or similar type of vehicle Location If the same vehicle type is not available, we will move the reservation to the nearest available car What if this new vehicle doesn't work for me? If your new car doesn’t work for you and you’d like to move to a different vehicle or location, give us a call at 866-4ZIPCAR and we will work to find another car that better meets your needs. You can always cancel the reservation and have it refunded within our cancellation window . Outside of this timeframe, feel free to give us a call at 866-4ZIPCAR and we will be happy to cancel and refund the reservation. Why did Zipcar cancel my booking? As a last resort, we may need to cancel your Zipcar trip if we are unable to source another vehicle at a suitable location for you. A full refund will be provided if this occurs.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/360023451054-What-s-included-with-my-Zipcar-trip", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/360023451054.json", "title": "What's included with my Zipcar trip?", "last_updated": "2024-04-16T15:45:49Z", "section_id": 4415635273491, "body": "Driving with Zipcar has its perks. Here is some of what is included in all bookings: Gas is on us , gas cards are in every Zipcar At least 180 miles included with each trip (may depend on your membership plan ) A free, designated parking spot 24-hour Roadside Assistance @ 866-4ZIPCAR", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/360024998354-My-reserved-Zipcar-is-not-parked-where-it-should-be-or-isn-t-here-what-should-I-do", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/360024998354.json", "title": "My reserved Zipcar is not parked where it should be or isn't here, what should I do?", "last_updated": "2024-03-23T19:36:33Z", "section_id": 115000306287, "body": "If you've booked a Zipcar and it isn't where it should be at the start of your trip, here are some things to check: Confirm you have the correct date, time, and location Make sure that your booking time has actually started (it's possible someone else has the car until your trip begins) Use the mobile app to honk the horn on the vehicle in case it has been parked nearby If you still can't find your booked Zipcar, give us a call and we will work to help locate it, or place you in another suitable vehicle in the area.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/360025013814-I-forgot-an-item-in-a-Zipcar-what-can-I-do", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/360025013814.json", "title": "I forgot an item in a Zipcar, what can I do?", "last_updated": "2024-04-03T23:38:35Z", "section_id": 360004492634, "body": "If you've forgotten an item in a Zipcar, you can make a booking and return to the vehicle at your earliest convenience. If you need help creating the booking, give us a call and we'll assist. Be sure to check the car's glove compartment and trunk when you return to the vehicle (that's typically where good Samaritans return forgotten items). Keep in Mind We are unable to cancel or interrupt any bookings on the vehicle We are unable to put you in touch directly with the member who used the car following your trip We are unable to contact the last member in the vehicle Zipcar is not responsible for forgotten or stolen items", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/360025159253-How-do-I-pay-an-overdue-balance-on-my-account", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/360025159253.json", "title": "How do I pay an overdue balance on my account?", "last_updated": "2025-02-10T20:59:27Z", "section_id": 115000306327, "body": "If you have an overdue balance, it might be because we were unable to process a payment using the payment method on your account. To pay your overdue balance, please update your payment method. You can update your payment method by following these steps: Mobile: Go to the Account tab at the bottom right of your Zipcar Mobile App Click on the Wallet tab in your Account Settings Under payment methods, select Add a Payment Method Enter your card information on the next screen Select Confirm Payment to add your card Website: Go to the My Account tab at the top right of the website Click on the Wallet tab Next to payment methods, select Add a Payment Method Enter your card information on the next screen Select Confirm Payment to add your card Your new payment method should be charged automatically. Once your payment has been processed successfully, you will be able to continue to book and drive Zipcars. Keep In Mind If you have backup payments enabled on your account, you agree to let Zipcar charge alternative payment methods as a backup when needed. Overdue balances cannot be paid using Google or Apple Pay.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/360025161813-What-do-I-need-to-know-before-my-first-Trip", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/360025161813.json", "title": "What do I need to know before my first Trip?", "last_updated": "2024-04-20T17:05:45Z", "section_id": 115000306287, "body": "For the best Zipcar experience, approved members should follow the steps below: Download our iPhone ® or Android ™ app to book your first trip and start driving. After you've booked your trip, the app may ask you to enable Location and Bluetooth . These permissions allow you to access the car. Use the mobile app to lock and unlock the car . The keys should always remain inside the vehicle . Note : Some members may have physical Zipcards , which will also allow you to lock and unlock the vehicle. Before you start driving, inspect your Zipcar inside and out and report any problems via our iPhone® or Android™ app. Gas is included in your trip. There is a g as card inside every Zi pca r ( in the visor above the driver's seat ) that should be used to pay for gas . Return your Zipcar to its home location on time , clean , and with at least 1/4 tank of gas to avoid extra fees . Trips in clude up to 200 miles per day in the US and 200 kilometers per day in Canada ( mileage may vary depending on your membership plan ).", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/360025508514-What-is-Zipcar-s-policy-on-pets-and-animals", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/360025508514.json", "title": "What is Zipcar's policy on pets and animals?", "last_updated": "2024-03-04T16:31:03Z", "section_id": 115000306187, "body": "Pets are not allowed in Zipcars unless they are in locked pet carriers . Members are subject to fees if evidence of pet hair is found in the vehicle they have reserved. We do waive the requirement for pets in carriers for members with service animals.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/360025857354-Why-is-my-account-suspended-and-what-can-I-do", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/360025857354.json", "title": "Why is my account suspended and what can I do?", "last_updated": "2024-05-01T06:26:06Z", "section_id": 115000314608, "body": "While your account is suspended, you will be unable to make bookings , change existing bookings, or unlock a Zipcar, but will still have access to sign in and review account settings and billing information. Accounts may be suspended for a number of reasons, including: Account has been compromised by an unauthorized user Account involved in an accident in a Zipcar Account involved in a missing or unreturned Zipcar Balance due on an account for more than three weeks Violations of Zipcar rules around late returns or car cleanliness Violations of the member contract If your account is suspended, you can make a request to have it unsuspended. Any decision made at that point will be final and ineligible for further review.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/360025998253-How-old-must-I-be-to-book-a-Zipvan-luxury-and-other-specialty-cars", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/360025998253.json", "title": "How old must I be to book a Zipvan, luxury, and other specialty cars?", "last_updated": "2024-04-28T06:06:43Z", "section_id": 4415635273491, "body": "To book a Zipvan, you must be 21+ years old. To book specialty vehicles, including minivans, trucks, & luxury cars, you must be 25+ years old.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/360026245213-How-can-I-find-where-my-booked-Zipcar-is-parked", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/360026245213.json", "title": "How can I find where my booked Zipcar is parked?", "last_updated": "2024-04-15T20:38:53Z", "section_id": 115000306287, "body": "After making a booking, you will find details about the location of the Zipcar you booked on the confirmation page of the website, on the booking page of the mobile app, as well as in your booking confirmation email. Details will include the address, pictures of the location, and any location-specific instructions to help you pickup your Zipcar. If your Zipcar is located in a garage there may be additional steps you need to take to pickup your car. If you're having trouble finding your Zipcar at its location, try honking the horn from the Zipcar mobile app. If you're still unable to locate the car, give us a call at 866-4ZIPCAR .", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/360026840813-How-do-I-redeem-promotional-driving-credit", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/360026840813.json", "title": "How do I redeem promotional & driving credit?", "last_updated": "2024-09-13T16:16:15Z", "section_id": 115000306327, "body": "Redeeming Driving Credit Android & iOS Login to your account on the Zipcar app From the bottom menu, select Account Select Wallet in the account settings and then Driving credit Select the + icon in the top right-hand corner Enter the credit code and select Redeem Zipcar Website Login to your account on the Zipcar website Select Account settings from the top right & select Wallet Select Add credit Enter the credit code and select Redeem Redeeming Booking Promotions Login to your account on the Zipcar app or website On the booking checkout screen, select Add promo code Input a promo code or select from available promotions in your inventory If the booking meets the promotion criteria, the discount will be applied to the cost of your booking Keep In Mind Driving credit expires, so be sure to check the expiration date after adding credit to your account Check a list of our our current promotions", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/360027372473-What-are-the-3-Zipcar-community-rules", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/360027372473.json", "title": "What are the 3 Zipcar community rules?", "last_updated": "2025-11-27T19:16:12Z", "section_id": 360004492634, "body": "When you share a Zipcar, you also share responsibility. These rules make sure every member enjoys their trip and helps you avoid fees. Win-win : Return to the car’s home location on time, or you’ll be charged for the extra time you used the car plus a late fee . No smoking and please clean up after yourself—otherwise, a cleaning fee of $50 will apply ($150 for smoking). If gas is below a ¼ tank, use the gas card in the visor to fill up, or you’ll be charged a $30 fee.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/360033129293-How-do-I-lock-unlock-my-Zipcar", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/360033129293.json", "title": "How do I lock & unlock my Zipcar?", "last_updated": "2024-05-01T01:40:19Z", "section_id": 115000306287, "body": "You can lock & unlock your Zipcar using the Zipcar iPhone ® or Android ™ mobile app or using your physical Zipcard if you have one. To lock & unlock with the Zipcar app: Open the \"Drive\" screen on your Zipcar app From here, you can locate the car using the map or by tapping the pickup location row for directions. If you're having trouble, try using the \"honk\" action to find the car Once you're next to the vehicle, tap unlock. If Bluetooth is not connected, the app will guide you to enable this permission. It's required to access our vehicles via the app When you're leaving the vehicle, be sure to tap lock from the same screen as before. No need to use the keys (which should always remain in the car!) For members with a Zipcard: Place your Zipcard over the Zipcar reader on the windshield (driver's side) Hold the Zipcard for 10-30 seconds, or until you hear a beep Tip If you are still unable to lock or unlock your vehicle, please refer to this troubleshooting article", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/360033218434--What-happens-in-the-event-a-vehicle-is-recalled-by-the-manufacturer", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/360033218434.json", "title": " What happens in the event a vehicle is recalled by the manufacturer?", "last_updated": "2023-10-16T19:11:39Z", "section_id": 360004492634, "body": "The safety of our members is our first priority, and we take recalls seriously. In the event Zipcar receives a recall notice, we will identify the affected vehicles in our fleet and remove them from our reservation system, preventing them from being used. Then we will address the recall according to the manufacturer’s instructions. During this process, if members have a reservation for a vehicle that’s part of a recall, we’ll move you to another Zipcar or change your reservation before your trip.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/360033373733-Does-Zipcar-have-a-Flex-or-One-Way-service", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/360033373733.json", "title": "Does Zipcar have a Flex or One Way service?", "last_updated": "2024-04-13T21:00:52Z", "section_id": 4415635273491, "body": "No, only round-trip bookings are currently available on Zipcars across North America. This means that your car must be picked up and dropped off at the same Zipcar location. Flexible bookings are currently only available in our London market. More information on the UK Flex program can be found here .", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/360038136153-What-is-the-Zipcar-for-Uber-program", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/360038136153.json", "title": "What is the Zipcar for Uber program?", "last_updated": "2025-11-12T23:11:27Z", "section_id": 360004492614, "body": "Zipcar and Uber have partnered to create a unique offering for Uber drivers. Drivers can join the Zipcar membership and rent Zipcars to drive & earn for Uber. This partnership allows drivers access to special Zipcar rental rates, rent from a diversified electric-forward fleet, 24/7 roadside assistance, and much more. The program is currently in the following metro areas: Los Angeles, San Francisco, Boston, Baltimore, Washington DC, Chicago, Miami, Denver, Atlanta, Seattle, Pittsburgh, and New Jersey. Joining How do I signup for the Zipcar for Uber program ? To join the Zipcar for Uber program, login to your Uber account and visit Uber’s Vehicle Marketplace in your Uber app or on the web and select Zipcar as the daily option. Create your Zipcar account and complete the driver application. You can also apply here . Once approved, you will be able to rent Zipcar for Uber reservations on the Uber Marketplace or Zipcar app. Most applications are approved within minutes. However, some applications can take up to two business days to be reviewed. I'm already a Zipcar member, can I join the Zipcar for Uber program? If you are already a Zipcar member, you can join the Zipcar for Uber program by signing up through the Uber Driver marketplace. Simply use the same email address and our system will match your accounts. This allows you to toggle between reservations you intend to use an Uber driver and reservations that are for personal use. Can I sign up for a personal membership if I am in the Zipcar for Uber program ? Zipcar for Uber drivers can open personal membership accounts with Zipcar. Application fees are typically waived when opening a secondary account but are subject to recurring membership fees. To open a personal account, login to your Zipcar account and open your Account Settings . From there select View Plans & Pricing , select the membership which meets your needs, and complete the sign-up process. After your application is approved, you can reserve and drive cars using your personal account. How old do I need to be to join the Zipcar for Uber program? Drivers must be 25 years or older. Are there any start-up or recurring costs to joining the Zipcar for Uber program? There are no application or membership costs associated with the Zipcar for Uber program. How much does it cost to rent a Zipcar under a Zipcar for Uber program ? The daily cost to rent a Zipcar can vary; we recommend visiting the Uber Vehicle Solutions site to see current rates. Can I drive for personal matters in the Zipcar for Uber program ? No, the Zipcar for Uber program is specifically for Uber driving purposes only. Can I use a Zipcar for Uber program vehicle to drive for Uber Eats Yes, you can use the Zipcar for Uber program to drive for Uber Eats. To sign up for the program, see how to join here . Booking & Driving I booked a car through the Zipcar app, why don't I see the car in my Uber app? Your Zipcar bookings will be visible in the Uber app approximately 1-hour before the start of your trip. If your booking has started and you do not see the car in the Uber app, please call us at 866-4ZIPCAR for assistance. Are there requirements for my Zipcar for Uber reservation? Yes, all drivers must complete a minimum of 8 Uber rides per 24-hour booking period. Does Zipcar provide an Uber Driver Kit or other trade dress accessories ? Zipcar does not provide any trade dress accessories. Drivers will need to bring their kit with them to their rental. How many miles are included in my Zipcar for Uber reservation? There are no mileage limitations for Zipcar for Uber reservations. Is EV charging or fuel included in my Zipcar for Uber reservations? EV charging is covered by Zipcar - use the charge card placed in the visor to pay for electric charging costs. The cost of fuel (in our limited internal combustion engine & hybrid feet) is not covered by Zipcar. How much EV charge or fuel should I return my car with? EVs should be returned with at least 20% charge. Internal combustion engines & hybrid vehicles should be returned with the same fuel level as the start of the trip (and at least 1/4 tank). Vehicles not returned with the expected charge or fuel levels are subject to additional fees . Account Management Can I add Additional Liability Insurance to my Zipcar for Uber reservations? At this time Additional Liability Insurance is not available for Zipcar for Uber reservations. Can I add Damage Protection to my Zipcar for Uber reservations? If you're age 25+, and have had no Zipcar accidents in the past 12 months, you are eligible to purchase damage protection to eliminate the damage fee. Purchasing damage protection won't change your insurance coverage, it just changes the maximum amount you'll be charged if you're involved in an incident with your Zipcar. Damage protection plans can be purchased per trip and rates may vary. How does insurance work? If you participate in the Zipcar for Uber program, the insurance maintained by Zipcar while you drive differs from if you were to drive a Zipcar as a Zipcar member. If you are already covered by other vehicle insurance, you agree that that vehicle insurance will be the primary insurance, with any insurance listed below to be secondary. If you are not otherwise covered by vehicle insurance, then the following insurance will apply in the periods indicated. To obtain coverage in the event of a claim, you have a duty to fully cooperate, and you must be in compliance with all other Uber and Zipcar terms and conditions. Uber may also maintain commercial auto insurance on your behalf. Click here for more details about the commercial auto insurance that Uber maintains on behalf of independent drivers transporting passengers via the Uber App. Stage Damage to vehicle Liability insurance Your Uber app is off (offline) Zipcar to cover in excess of the $1,000 deductible Zipcar to provide liability coverage up to the minimum financial responsibility limits required in the state/jurisdiction in which the accident occurs Your Uber app is on (available and waiting for a trip request) Zipcar to cover in excess of the $1,000 deductible Uber to maintain liability coverage of at least $50,000 bodily injury per person, $100,000 bodily injury maximum, and $25,000 property damage. Your Uber app is on (en-route or on-trip) Zipcar to cover in excess of the $1,000 deductible Uber to maintain liability coverage of at least $1,000,000 CSL (combined single limit) per accident and at least $250,000 for uninsured and underinsured motorist bodily injury when traveling with a passenger. See program terms here .", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/360038750813-Where-can-I-find-Zipcar-s-privacy-notice", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/360038750813.json", "title": "Where can I find Zipcar's privacy notice?", "last_updated": "2024-03-27T16:40:36Z", "section_id": 115000314608, "body": "The Zipcar privacy notice can be found here .", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/360038838833-How-do-I-invite-drivers-to-join-my-standard-plan-or-business-account", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/360038838833.json", "title": "How do I invite drivers to join my standard plan or business account?", "last_updated": "2024-10-30T16:30:53Z", "section_id": 4415629181203, "body": "As an owner or admin of an account, you can invite others to join and drive under your account by following the below steps: Login to your Zipcar account Click on My Account at the top of the page and select Account Settings Select the People tab Select +Add Member Input the email address of the new member Select the damage protection coverage Click Send Invite Keep In Mind Only owners & admins of a standard plan or business account can add members For Standard Plans only one additional driver is allowed All fees & charges of the member will be billed to the credit card associated with the standard plan or business account If the invited user does not already have a Zipcar membership, they will be asked to go through the application process", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/360051185973-What-is-additional-liability-insurance-ALI", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/360051185973.json", "title": "What is additional liability insurance (ALI)?", "last_updated": "2024-04-10T18:31:21Z", "section_id": 4415790262035, "body": "Additional Liability Protection (optional supplemental liability insurance) may be available for purchase for hourly or daily trips you take with Zipcar in the United States. If you decide to purchase this additional protection, it provides you excess coverage up to $300,000 under a policy of insurance offered by a third party insurance company if claims are made by third parties against you while you were using a Zipcar. For purposes of this policy, you may be referred to as a “rentee” under the policy, which is an “Excess Automobile Liability Insurance Policy” that provides additional liability insurance, within specified limits, above the limits provided in the Zipcar Member Agreement – referenced under “Third Party Liability” Section. The additional liability insurance coverage limits equal the difference between the maximum $300,000 combined Single limit under the policy and the liability protection limits provided under the Zipcar Member Agreement – referenced under “Third Party Liability” Section. What is Additional Liability Protection? Additional Liability Protection insures you against claims made by third parties against you, the member, for bodily injury/death and property damage caused by the use or operation of a Zipcar vehicle in accordance with the Zipcar Member Agreement. This coverage is a separate insurance policy issued to Zipcar by a third party insurance company. More details about the coverage terms and conditions are summarized here . It is made available to you when booking a Zipcar vehicle. If you elect to purchase it for an additional hourly or daily charge as shown at the time of booking, you are covered while driving your Zipcar vehicle within the United States and Canada, but only if the trip begins and ends in the United States. Zipcar vehicles may not be taken into Mexico, and this coverage does not apply in Mexico. Rates may vary by state. If you purchase this insurance at the time of reservation, the insurance coverage is restricted only to the vehicle rented in that reservation and only for the period the coverage is purchased for the respective rental vehicle in the same reservation. Your personal insurance policy providing coverage on an owned automobile, or other personal policy, may provide additional coverage, and to that extent, the Additional Liability Protection may provide a duplication of coverage. To determine whether, at what point, and to what extent your own policies apply, you should check the terms of the policies themselves as these terms frequently vary. The protection afforded by Additional Liability Protection is primary to your own policies. This means that before your own policies would apply to pay a claim, the $300,000 protection afforded by the combination of Additional Liability Protection and the Zipcar Membership Agreement limits would have to be exhausted. How to add Additional Liability Protection If available, you can purchase Additional Liability Protection for an hourly or daily trip in the United States in the app or on our website when booking a reservation. To purchase this insurance for your hourly or daily trip, click on additional liability protection and select Add protection . Rates may vary by state. Keep In Mind Additional Liability Protection purchases are non-refundable after your trip has started ALI will not apply if members are not in compliance with the Zipcar Member Agreement Members engaging in prohibited uses of Zipcar will not covered by Additional Liability Protection This is only a general summary of Additional Liability Protection and only the policy governs the terms and conditions of coverage - please consult the policy via the links below Additional Liability Protection Brochures General brochure (all other states not listed below) Florida Louisiana Maryland New Hampshire New York Washington", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/360051627973-How-can-I-make-a-privacy-rights-request", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/360051627973.json", "title": "How can I make a privacy rights request?", "last_updated": "2024-02-07T21:57:42Z", "section_id": 115000314608, "body": "Depending on your state of residency and subject to certain legal limitations and exceptions, you may be able to exercise some or all of the following rights: The Right to Know/Access/Portability The right to obtain access to the personal information we have collected about you and, where required by law, the right to obtain a copy of the personal information in a portable and, to the extent technically feasible, readily usable format that allows you to transmit the data to another entity. To make a right to know/access/portability request, follow these steps: Sign in to your Zipcar account Submit your request for records The Right to Request Deletion The right to request the deletion of personal information we have collected from you, subject to certain exceptions. To make a right to deletion request, follow these steps: Sign in to your Zipcar account Submit your request for data deletion The Right to Correction The right to correct inaccuracies in your personal information, taking into account the nature of the personal information and the purposes of the processing of the personal information. You may be able to make corrections yourself by logging into your account and navigating to the Account Settings page. Learn more about updating your account information here .", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/360056800994-Why-does-my-upcoming-booking-show-the-vehicle-as-unassigned", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/360056800994.json", "title": "Why does my upcoming booking show the vehicle as unassigned?", "last_updated": "2024-03-22T15:48:00Z", "section_id": 4415635273491, "body": "When a vehicle you had booked for your trip requires unanticipated maintenance that must be addressed immediately, we may have to temporarily remove the vehicle from your booking . This doesn't necessarily mean that the car you booked won't be available at the time of your trip, but it is a possibility. Rest assured, our team will make every attempt to get you back into your original vehicle and if not, we will work to get you into a suitable alternative . This can take some time, so we ask that you bear with us as we work on getting your vehicle road ready again. If a new vehicle is required for your trip, we'll notify you via email as soon as your trip has been updated. Keep In Mind If your trip is starting in the next 24 hours and you notice that your vehicle ’s details are still missing, please feel free to call us at 866-4ZIPCAR", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/360061662133-Can-Zipcar-provide-an-experience-letter-of-insurance-for-my-current-automotive-insurance-provider", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/360061662133.json", "title": "Can Zipcar provide an experience letter of insurance for my current automotive insurance provider?", "last_updated": "2024-03-27T15:48:15Z", "section_id": 115000314608, "body": "At this time, Zipcar does not offer experience letters of insurance to current or past members. An experience letter of insurance is a statement of confirmation that an individual held an auto insurance policy for a period of time. For car owners, these letters can help confirm previous or current coverage and potentially result in a discounted rate from an insurance company.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/1500000444102-How-do-I-take-my-Zipcar-in-and-out-of-a-garage-that-requires-a-parking-pass-or-code", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/1500000444102.json", "title": "How do I take my Zipcar in and out of a garage that requires a parking pass or code?", "last_updated": "2024-03-21T16:01:22Z", "section_id": 115000306287, "body": "After booking your Zipcar, you can find location details in the mobile app, in your confirmation email, or on the website. These details will include instructions and pictures to help you locate and access your Zipcar. There will also be information on parking passes and gate codes and if the car is in an enclosed garage. Parking passes will typically be located in the visor above the driver's seat, along with the car's gas card. It might also be in the glove compartment, cup holder, set on the dashboard, or left in the door storage area. If the provided gate code does not work, or if the vehicle is missing the parking pass to gain entry/exit to the garage, give us a call so we can troubleshoot and help you get on your way.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/1500003261542--What-should-I-do-if-I-m-unable-to-return-my-Zipcar-to-its-spot-or-location", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/1500003261542.json", "title": " What should I do if I'm unable to return my Zipcar to its spot or location?", "last_updated": "2024-03-20T04:59:49Z", "section_id": 115000314548, "body": "If you're having difficulty returning your Zipcar to the garage or parking spot it belongs to, open up the location details of the car's home location to see if any guidance or troubleshooting is available. You can find this information in your booking confirmation email, or on the My Trips section of your mobile app (find the trip and select View Details ). There you might find helpful tips on what to do if the parking spot is occupied, the garage is closed, an entry parking pass is missing, or if you're having a problem with having the car valeted. If you continue to experience parking issues, or if the troubleshooting information provided doesn't resolve your issue, contact us for assistance.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4405507317651-How-do-I-update-my-name", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4405507317651.json", "title": "How do I update my name?", "last_updated": "2024-05-03T13:30:31Z", "section_id": 360004537873, "body": "You can update the name on your account on a web browser by following the steps below: Sign in to your account Click on My Account at the top of the page and select Account Settings Click the Name card under your personal information Input your first & last name and select Update name", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4405507784723-How-do-I-update-my-driver-s-license-information", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4405507784723.json", "title": "How do I update my driver's license information?", "last_updated": "2024-04-19T17:19:52Z", "section_id": 360004537873, "body": "You can update your driver's license information by signing into your account on a web browser and following the steps below: Sign in to your account Click on My Account at the top of the page and select Account Settings Click on the Driver's License card Enter your license details in the space provided and click Continue Keep In Mind You can currently only update your driver's license information via a web browser", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415610020371-How-do-I-join-a-promotional-membership-plan", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415610020371.json", "title": "How do I join a promotional membership plan?", "last_updated": "2025-08-18T15:59:54Z", "section_id": 115000305987, "body": "If you are creating a new account, you may be eligible to receive discounts or promotions offered by a sponsoring business or organization. One example of this is AARP, which offers promotional membership plans with Zipcar. Available incentives and offerings will vary by promotional program, but may include a discounted first-year membership fee, waived application fee, or driving credit (upon approval of application). To join a promotional membership plan, please contact the sponsoring organization directly. An admin or representative of the promotional program will provide a unique URL that will allow you to receive promotional discounts. Keep In Mind Zipcar is unable to provide the contact information of promotional account admins Zipcar is unable to provide unique join links to a promotional rate plan Promotional membership plans are only available to new members upon joining. Eligible memberships may be able to change to a promotional rate plan. Please see How do I change my membership plan? for more details)", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415610552083-How-do-I-invite-new-admins-to-join-my-business-account", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415610552083.json", "title": "How do I invite new admins to join my business account?", "last_updated": "2022-08-16T04:21:11Z", "section_id": 4415629181203, "body": "As an owner or admin of an account, you can invite other admins to join and manage your account by following the below steps: Sign in to your Zipcar account Click on My Account at the top of the page and select Account Settings Select the People tab Select +Add Member Select the Admin only role Input the email address(es) of the new admins Click Send Invite Keep In Mind Only owners & admins of a business account can add new admins After a new admin joins, their role can be updated to include driving access", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415610576787--How-do-I-remove-drivers-from-my-account", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415610576787.json", "title": " How do I remove drivers from my account?", "last_updated": "2024-04-30T23:44:22Z", "section_id": 4415629181203, "body": "If you have multiple drivers on your account, you can remove them at any time by following the below steps: Sign in to your Zipcar account Click on My Account at the top of the page and select Account Settings Select the People tab and search for the user you wish to remove Click the overflow menu (3 vertical dots) Select Remove member Keep In Mind Only owners & admins of a family or business account can remove members", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415610676243-How-do-I-update-the-roles-of-users-on-my-business-account", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415610676243.json", "title": "How do I update the roles of users on my business account?", "last_updated": "2022-04-25T01:06:37Z", "section_id": 4415629181203, "body": "Admins and owners of business accounts can modify the roles of any user on the account to a driver , admin , or combination of admin & driver by following the below steps: Sign in to your Zipcar account Click on My Account at the top of the page and select Account Settings Select the People tab Click the overflow menu (3 vertical dots) next to the driver you would like to update Select Update role Check the boxes of the roles you would like the user to have and click Update role Repeat the above steps for each user you would like to update the roles of. Keep In Mind Only admins and owners of a business account can update user roles Users who have all roles removed will be removed from the account", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415613404179-How-do-I-resend-an-invitation-to-another-user-to-join-my-account", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415613404179.json", "title": "How do I resend an invitation to another user to join my account?", "last_updated": "2023-04-12T14:09:40Z", "section_id": 4415629181203, "body": "If you have invited another user to join your family or business account, an invitation email will be sent to the email address provided. If the user can't find the email we sent them, or if the link to join your account has expired, you can resend the invitation to them by following the below steps: Sign in to your Zipcar account Click on My Account at the top of the page and select Account Settings Select the People tab Search for the user to resend the invitation to Click the overflow menu (3 vertical dots) Select Resend invitation Keep In Mind Only owners & admins of a family or business account can resend invitations to drivers.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415614175379-How-do-I-rescind-an-invitation-to-a-user-to-join-my-account", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415614175379.json", "title": "How do I rescind an invitation to a user to join my account?", "last_updated": "2023-12-11T19:12:23Z", "section_id": 4415629181203, "body": "If you have invited a user to join your family or business account, an invitation email will be sent to the email address provided. If the user has not completed their application yet, you can rescind the invitation from the user to join your account by following the below steps: Sign in to your Zipcar account Click on My Account at the top of the page and select Account Settings Select the People tab Search for the user to resend the invitation to Click the overflow menu (3 vertical dots) Select Remove member Keep In Mind Only owners & admins of a family or business account can revoke invitations or remove members.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415614615315-How-do-I-create-a-student-faculty-or-alumni-account-through-my-university", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415614615315.json", "title": "How do I create a student, faculty, or alumni account through my university?", "last_updated": "2025-11-26T00:08:21Z", "section_id": 115000305987, "body": "To submit an application to join Zipcar through your university, follow the steps below: Find and select your school on our university page Select a student, alumni, or faculty & staff plan Input your name, university email address and password to create your account Follow the steps to upload your driver's license and take a selfie to verify your identity Input your billing information Submit your application Keep In Mind Most applications are instantly reviewed and approved or rejected A University Department Account puts all drivers on your staff on a single account to help you streamline your transportation and budget management. There’s no setup fee—just an annual membership fee for each driver. To set up a university department account click here to submit a request. In some cases, it may take several business days to fully review the application and more information may be requested.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415629841683-How-do-I-join-an-existing-family-or-business-account", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415629841683.json", "title": "How do I join an existing family or business account?", "last_updated": "2023-04-03T19:56:17Z", "section_id": 115000305987, "body": "Whether you already have a Zipcar account or membership, you have the ability to join and drive under a family or business account other than your own. To join an account, you must be invited by an admin or owner of the account. Once invited, you will receive an email invitation to join the account and, for users who don't already have a Zipcar membership, be invited to submit an application to drive. We encourage users to reach out directly to the admins and owners of family and business accounts directly to request an invitation to join their account. Keep In Mind Zipcar is unable to provide the admin or owner contact information of a family or business account Zipcar is unable to add drivers directly to a family or business account If you are invited to join a family or business account, an active account and approved application to drive are required", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415630538515--Am-I-eligible-to-create-a-student-faculty-or-alumni-account", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415630538515.json", "title": " Am I eligible to create a student, faculty, or alumni account?", "last_updated": "2024-03-11T21:44:01Z", "section_id": 4415725357075, "body": "Zipcar has partnerships with hundreds of universities across North America. To join a university account, you must: Be associated with a university Zipcar is partnered with Have access to a valid .edu email address with the university Be an active student, alumni, or faculty/staff member of the university Discounts and perks associated with a university membership will vary by university and association. Full details can be found here . Keep In Mind All applicants will be asked to verify their .edu email address when applying to join Zipcar", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415632195731-Can-I-have-multiple-credit-cards-on-my-account", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415632195731.json", "title": "Can I have multiple credit cards on my account?", "last_updated": "2024-06-07T21:27:38Z", "section_id": 115000306327, "body": "Yes, you may have up to 10 payment methods added to your Zipcar wallet. Only one card can be used at a time to pay for any amount due. To update your payment information, follow the steps in this guide .", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415634172691-How-can-I-update-my-email-address-if-I-no-longer-have-access-to-that-email", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415634172691.json", "title": "How can I update my email address if I no longer have access to that email?", "last_updated": "2024-03-14T14:25:06Z", "section_id": 360004537873, "body": "Experiencing login issues with your Zipcar account due to a lost email? We've got your back. To regain access and update your email, let's verify your identity. Email us at account-recovery@zipcar.com with these details: Your current Zipcar account email The new email you want to use (make sure to email us from this address) Explain the issue preventing login or email update Snap a clear photo of your driver's license (matching your account) Take a picture holding your license (showing your face and the license) If your license address differs, send a matching document (utility bill, etc.) Keep In Mind If you are still able to login to your Zipcar account but no longer have access to your email inbox, you can still update your email by having a verification code sent to the phone number on file. Instructions can be found here .", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415636413075--I-found-a-lost-item-in-a-Zipcar-what-should-I-do", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415636413075.json", "title": " I found a lost item in a Zipcar, what should I do?", "last_updated": "2024-02-20T08:53:11Z", "section_id": 115000306307, "body": "If you find a lost item in a Zipcar, please place it in the glove compartment or the trunk. If it is an item of considerable value or something that may be time-sensitive, such as medication, please give us a call for assistance.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415636457107-Should-I-take-the-Zipcar-keys-out-of-the-car-during-my-trip", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415636457107.json", "title": "Should I take the Zipcar keys out of the car during my trip?", "last_updated": "2023-12-09T14:36:23Z", "section_id": 115000306307, "body": "No, the car keys should stay in the Zipcar at all times. To lock & unlock your Zipcar, use your iPhone ® or Android ™ mobile app or Zipcard.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415637993107-How-do-I-change-the-damage-protection-coverage-for-drivers-on-my-business-account", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415637993107.json", "title": "How do I change the damage protection coverage for drivers on my business account?", "last_updated": "2023-08-25T22:40:48Z", "section_id": 360004537873, "body": "As an admin or owner of a business account, you can manage the damage protection associated with all drivers on your account by following the below steps: Sign in to your Zipcar account Click on My Account at the top of the page and select Account Settings Under Account info , click on Damage Protection Select the level of protection you would like Select Update protection Keep In Mind Only owners & admins of a business account can update damage protection coverage Damage protection cannot be set on a driver-basis for business account", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415638616979-How-can-I-purchase-damage-or-liability-protection-on-my-trip", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415638616979.json", "title": "How can I purchase damage or liability protection on my trip?", "last_updated": "2024-03-15T16:47:22Z", "section_id": 360004537893, "body": "Insurance coverage can be purchased in a couple of different ways, depending on what protection you are looking for. Subscribing to Damage Protection If you would like to purchase a recurring damage protection subscription, this can be done by following the steps below: Sign in to your Zipcar account Click on My Account at the top of the page and select Account Settings Click on Damage protection Select the insurance protection level you would like Click Update protection Purchasing Damage or Liability Protection per Trip If a subscription isn't your thing, you can also purchase our damage and liability protection on a per-trip basis. When creating your booking, you will be asked if you would like to purchase any additional insurance coverage upon checkout. Sign in to your Zipcar account Search and select a vehicle to book Select the insurance coverage you would like Click Book this car to checkout Keep In Mind If you are driving on a business account, only the business admin or owner is able to configure the damage protection coverage Additional Liability Insurance (ALI) is currently unavailable for members driving on a business account", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415641078803-Do-I-need-a-Zipcard-to-drive-a-Zipcar", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415641078803.json", "title": "Do I need a Zipcard to drive a Zipcar?", "last_updated": "2024-04-21T10:55:22Z", "section_id": 115000306287, "body": "No, a Zipcard is not needed as all of our US Zipcars have Bluetooth® technology. This technology allows your mobile phone to lock, unlock, as well as start and end trips on all US Zipcars from the iPhone ® or Android ™ app . If you would still like to have a Zipcard, please send a request using this link .", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415642075283-Are-there-discounted-driving-rates-overnight", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415642075283.json", "title": "Are there discounted driving rates overnight?", "last_updated": "2024-05-01T12:16:07Z", "section_id": 4415635273491, "body": "Some cities have promotional overnight rates for bookings between 6pm and 8:30am, Monday through Thursday. You can book at any point during these hours to get the discounted rate. If the hourly fee is less than the overnight bundle, you'll be charged the lesser of the two rates. The overnight rate varies depending on the vehicle and location, and our system will automatically charge the lowest available rate depending on the length and time of your reservation. Keep In Mind If you begin your Zipcar trip before 6pm or extend your reservation beyond 8:30am, the overnight rate will no longer apply Bookings which include overnight periods but extend outside the overnight window are not eligible for the discounted rate", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415642580115-I-m-having-trouble-unlocking-with-my-phone-what-should-I-do", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415642580115.json", "title": "I'm having trouble unlocking with my phone, what should I do?", "last_updated": "2024-04-19T15:50:19Z", "section_id": 115000306287, "body": "If you're having trouble locking & unlocking your Zipcar from the iPhone ® or Android ™ mobile app, here are some things to try: Confirm location services , bluetooth , & cellular data are enabled in your phone's settings If bluetooth is already on, try toggling it off and back on Grant precise location access to the Zipcar app when prompted (if you're not prompted, go into your phone's settings and manually grant access ) Be sure you're standing right next to the car If all else fails, try your Zipcard Still having problems? Be sure that all the necessary permissions have been enabled for the Zipcar app. More information on how to manually enable those permissions can be found here .", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415643228819-Can-I-unlock-my-car-while-in-a-garage-with-poor-or-no-reception", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415643228819.json", "title": "Can I unlock my car while in a garage with poor or no reception?", "last_updated": "2024-04-14T12:08:58Z", "section_id": 115000306287, "body": "All members are able to access Zipcars in areas of poor or no cellular reception. All of our US vehicles have Bluetooth® technology which allows you to lock, unlock, start, and end trips on all Zipcars from the iPhone ® or Android ™ app .", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415645956499-How-can-I-change-the-owner-of-my-account", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415645956499.json", "title": "How can I change the owner of my account?", "last_updated": "2024-04-16T15:55:36Z", "section_id": 4415629181203, "body": "Ownership is typically non-transferrable. However, there may be cases in which the owner of a business account (the user who created the account) needs to be changed. If the owner of an account is no longer with the business, our team of account specialists will be able to assist to ensure ownership is transferred to a new responsible party. To be eligible for an ownership transfer, the following criteria must be met: The original owner must no longer be with the business is an administrative capacity The proposed replacement owner must have an admin account with the business An email with the documents listed below must be sent from the proposed replacement owner If your business account fits the above criteria, please email business@zipcar.com with the below information: Employment verification Typically a letter from a human resources or similar department, though some organizations use a 3rd party for employment verification Employee badge or business card Letter from management or higher (on company letterhead) confirming and authorizing the request", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415646172435-How-can-I-see-how-much-driving-credit-is-currently-available-on-my-account", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415646172435.json", "title": "How can I see how much driving credit is currently available on my account?", "last_updated": "2024-09-17T09:09:44Z", "section_id": 115000306327, "body": "You can review the available driving credit on your account by following the steps below: To view your driving credit expiration dates in the Zipcar Mobile App: Always ensure the Zipcar app is up-to-date! Open up the app and click on Account at the bottom right Tap on Wallet Under your payment methods, look for the Driving credit section Tapping on the amount will show you your driving credit history To view your driving credit expiration dates on the Website: Sign in to your Zipcar account Click on My account from in the top right corner and then Account settings Click on Wallet and scroll down until you see your Driving Credit section Click Show details from the driving credit card as shown below Review the available credit", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415646799251-Does-driving-credit-expire", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415646799251.json", "title": "Does driving credit expire?", "last_updated": "2024-09-17T09:09:44Z", "section_id": 115000306327, "body": "Yes, driving credit does have an expiration date. Credit not used prior to the expiration date will be removed from your account. You can review the available driving credit on your account and the expiration date by following the steps below: To view your driving credit expiration dates in the Zipcar Mobile App: Always ensure the Zipcar app is up-to-date! Open up the app and click on Account at the bottom right Tap on Wallet Under your payment methods, look for the Driving credit section Tapping on the amount will show you your driving credit history and expiration dates To view your driving credit expiration dates on the Website: Sign in to your Zipcar account Click on My account from in the top right corner and then Account settings Click on Wallet and scroll down until you see your Driving Credit section Click Show details from the driving credit card as shown below Review the available credit and expiration dates", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415648675091-How-do-I-modify-or-cancel-my-booking", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415648675091.json", "title": "How do I modify or cancel my booking?", "last_updated": "2024-04-16T17:46:19Z", "section_id": 115000306187, "body": "Shortening, extending, or canceling your booking, or updating the insurance protection coverage, can be done from the web or from the Zipcar app on iPhone ® or Android ™. Sign in to your Zipcar account Select Trips from the navigation menu Find the trip you wish to modify and select Edit To modify the trip times, use the timeline slider and select Update To change your booked Zipcar, click on Change car under the vehicle image, select your preferred vehicle, and select Update To cancel your trip, select Cancel trip at the bottom of the modal To update the insurance coverage, select or deselect available protection options and click Update Keep In Mind Cancellation fees may apply in some cases", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415654739219-Do-I-pay-for-toll-charges-when-using-a-Zipcar", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415654739219.json", "title": "Do I pay for toll charges when using a Zipcar?", "last_updated": "2025-05-16T15:52:19Z", "section_id": 4415635273491, "body": "Yes, members are responsible for paying all toll charges. While we don't charge you extra fees, you will be responsible for any and all tolls incurred during your trip. It may take a few weeks for Zipcar to receive the tolls from the municipality or local authority. Toll fees will appear in the list of charges for the associated trip and will be processed as a separate charge, to either the same card used to book or the account default card if the trip was booked using Apple Pay or Google Pay. You'll also receive an email from us anytime you're billed for a toll charge. You can find your trip summaries and invoices on your account page here . Keep In Mind Zipcars use pay-by-plate. Be sure to take pay-by-plate toll lanes. Do not use a personal toll pass as this may result in double-charging by the toll authority, and Zipcar is unable to remove toll charges incurred during a reservation", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415677417107-The-fuel-card-isn-t-working-what-can-I-do", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415677417107.json", "title": "The fuel card isn't working, what can I do?", "last_updated": "2024-04-22T21:13:34Z", "section_id": 360004492634, "body": "If the fuel card in your car isn't working, here are some things to keep in mind that might help: Make sure you're only trying to purchase gas Always try paying at the pump If a pre-authorization amount is requested, input $50 or less If you are prompted to input a zip code, enter your billing zip code Avoid filling the tank with small amounts of gas or using the fuel card multiple times over a short period of time If you continue to experience issues and the fuel card doesn't cooperate, please pay for fuel on your own and submit your receipts to be reimbursed .", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415680792467-If-I-don-t-end-my-Zipcar-trip-will-it-end-automatically", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415680792467.json", "title": "If I don't end my Zipcar trip, will it end automatically?", "last_updated": "2024-03-04T00:59:30Z", "section_id": 115000314548, "body": "Yes, as long as the car has been returned to its home location, the ignition is off, and the doors have been closed and locked, your trip will automatically end at the end-time of your booking. Keep In Mind Keep in mind, you will continue to have access to the vehicle until your trip has ended", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415707739155-If-I-return-my-Zipcar-early-can-I-still-drive-it", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415707739155.json", "title": "If I return my Zipcar early, can I still drive it?", "last_updated": "2024-02-08T16:30:59Z", "section_id": 115000314548, "body": "Yes, if you return your Zipcar to the home location early and do not end your trip, you will continue to have access to your Zipcar until the booking time ends. Learn more about ending your trip here .", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415707891603-If-I-return-my-Zipcar-early-and-end-my-trip-will-I-be-refunded-for-unused-time", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415707891603.json", "title": "If I return my Zipcar early and end my trip, will I be refunded for unused time?", "last_updated": "2024-04-03T23:50:45Z", "section_id": 115000314548, "body": "No, you are charged at the time of booking for the duration booked. Trips which are ended early are not eligible for a prorated refund for unused time. Ending your trip will make the car available to be booked by others.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415708253203-What-is-damage-protection-coverage", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415708253203.json", "title": "What is damage protection coverage?", "last_updated": "2025-02-28T16:27:11Z", "section_id": 4415790262035, "body": "If you're age 18+, and have had no Zipcar accidents in the past 12 months, you are eligible to purchase damage protection to reduce or eliminate the damage fee . Purchasing damage protection won't change your insurance coverage, it just changes the maximum amount you'll be charged if there is damage to your Zipcar. Damage protection plans can be purchased on a per-trip basis, or via a monthly or annual subscription. The following damage protection plans are currently available: Standard protection (included in membership) $2,500 fee per Zipcar may apply Plus protection $375 fee per Zipcar may apply Premium protection $0 per Zipcar Keep In Mind Damage protection waivers are non-refundable and become effective at the purchase date and time Terms & conditions can be found in the membership contract", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415712341139-Can-I-use-a-Zipcar-as-a-taxi-or-ride-share-service", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415712341139.json", "title": "Can I use a Zipcar as a taxi or ride share service?", "last_updated": "2024-04-01T19:55:17Z", "section_id": 360004492634, "body": "Zipcar and Uber have partnered to launch the Zipcar for Uber program. This partnership allows Uber drivers to sign up through Uber’s Vehicle Marketplace to rent Zipcars at a discounted rate and earn with Uber. Learn more about the Zipcar for Uber program here .", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415712810131-Can-damage-protection-be-applied-to-only-certain-drivers-under-a-business-account", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415712810131.json", "title": "Can damage protection be applied to only certain drivers under a business account?", "last_updated": "2023-09-28T14:25:22Z", "section_id": 360004537893, "body": "Damage protection cannot be applied to individual drivers on business accounts. It can only be applied for all or no drivers on the account. You can learn more about updating your protection plan coverage here.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415715895699-Where-can-I-find-the-Zipcar-membership-contract", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415715895699.json", "title": "Where can I find the Zipcar membership contract?", "last_updated": "2024-03-15T20:24:07Z", "section_id": 115000314608, "body": "The Zipcar membership contract can be found here .", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415717036947-Do-drivers-joining-my-account-pay-any-fees-membership-application", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415717036947.json", "title": "Do drivers joining my account pay any fees (membership, application)?", "last_updated": "2023-10-16T07:07:40Z", "section_id": 115000306327, "body": "No, account fees (such as membership and application fees) are charged to the payment method associated with the account the drivers are joining. The type of fee or amount to be charged depends on your membership plan and any sponsorship you may have. You can review all fees charged to your account by following the steps below: Sign in to your Zipcar account Click on Billing in the top navigation menu Review all transactions posted to your account Keep In Mind Some transactions, like tolls, violations, & citations may come in several weeks following a driver's trip", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415717669139-Can-I-create-cancel-or-modify-bookings-of-drivers-on-my-account", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415717669139.json", "title": "Can I create, cancel, or modify bookings of drivers on my account?", "last_updated": "2025-02-21T20:20:52Z", "section_id": 4415635273491, "body": "Yes, account admins and owners are able to create, cancel, or modify the bookings of any driver on their business account. To create a booking for a driver on your account, select a car for their trip on the Book tab , choose the driver from the drop-down menu, and complete your reservation. To cancel or modify a driver’s booking, select the driver from the drop-down menu in the Trips tab and update the necessary booking as needed. Keep In Mind This book on behalf of feature is not available in the Zipcar app. Account admins & owners can view all upcoming, ongoing, and past trips of their drivers .", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415717733907-Can-I-see-upcoming-ongoing-or-completed-trips-of-drivers-on-my-account", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415717733907.json", "title": "Can I see upcoming, ongoing, or completed trips of drivers on my account?", "last_updated": "2024-03-29T19:29:46Z", "section_id": 4415629181203, "body": "Yes, account admins and owners can see all upcoming, ongoing, and completed trips of drivers on their account Sign in to your Zipcar account Click on Trips in the top navigation menu Review all booking & trip activity of drivers on your account Keep In Mind Account admins & owners are currently unable to manage or modify the bookings of drivers on their account", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415718214931-Who-is-responsible-for-the-charges-fees-on-my-account", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415718214931.json", "title": "Who is responsible for the charges & fees on my account?", "last_updated": "2024-04-28T18:38:31Z", "section_id": 115000306327, "body": "Account & trip fees (including membership and application fees) are charged to the payment method associated with the account the drivers are joining. The type of fee or amount to be charged depends on your membership plan and any sponsorship you may have. You can review all fees charged to your account by following the steps below: Sign in to your Zipcar account Click on Billing in the top navigation menu Review all transactions posted to your account Keep In Mind Some transactions, like tolls, violations, & citations may come in several weeks following a driver's trip", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415718353043-Can-I-export-the-invoices-for-my-business-account", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415718353043.json", "title": "Can I export the invoices for my business account?", "last_updated": "2023-12-20T19:21:02Z", "section_id": 115000306327, "body": "Yes, to export invoices for your business account, follow the steps below: Sign in to your Zipcar account Click on Invoices in the top navigation menu Export invoices as a CSV or PDF", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415719157779-How-can-I-bring-Zipcar-to-my-campus", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415719157779.json", "title": "How can I bring Zipcar to my campus?", "last_updated": "2023-03-18T00:51:12Z", "section_id": 4415725357075, "body": "If you would like to bring Zipcar to your college or university, fill out the form on our university page . Once submitted, our Zipcar for Universit ies Team will be in touch.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415721982355-How-can-I-opt-out-of-the-sharing-or-sale-of-my-personal-information", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415721982355.json", "title": "How can I opt out of the sharing or sale of my personal information?", "last_updated": "2024-03-03T19:25:30Z", "section_id": 360004537873, "body": "You can opt out of the sharing or the sale of your personal information by following the below steps: Sign in to your account Select Do Not Sell My Info at the bottom of the page Confirm your selection", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415723098003-Are-service-animals-allowed-for-members-with-disabilities", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415723098003.json", "title": "Are service animals allowed for members with disabilities?", "last_updated": "2024-03-14T20:20:14Z", "section_id": 115000306187, "body": "For members with service animals, we waive the requirement that pets should be in carriers. We do ask that you help care for our vehicles and ensure pet hair and odors are cleaned from the car at the end of your trip.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415724194451-Is-driving-credit-on-my-account-available-to-all-drivers-on-my-account", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415724194451.json", "title": "Is driving credit on my account available to all drivers on my account?", "last_updated": "2024-04-12T01:52:32Z", "section_id": 115000306327, "body": "Yes, driving credit is used towards the cost of a booking prior to any card payment and is available to all drivers on your account. Any leftover credit will remain on your account until it is used or expires.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415724260627-How-can-I-update-the-name-of-my-business", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415724260627.json", "title": "How can I update the name of my business?", "last_updated": "2022-02-18T10:00:11Z", "section_id": 360004537873, "body": "The business name on file cannot be changed online. Please reach out to us at business@zipcar.com so we can assist you with your request.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415724617491-How-can-I-view-current-and-past-invoices-or-statements-for-my-business-account", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415724617491.json", "title": "How can I view current and past invoices or statements for my business account?", "last_updated": "2024-03-04T01:14:18Z", "section_id": 115000306327, "body": "If you pay on a monthly basis, current and past invoices for an account can be viewed by following the steps below: Sign in to your Zipcar account Click on Invoices in the top navigation menu Each invoice other than the current invoice will have a payment status next to it (paid or unpaid) and can be viewed as a CSV or PDF document. If you pay by credit card, individual transactions for your account can be viewed by following the steps below: Sign in to your Zipcar account Click on Billing in the top navigation menu Select individual trips or transactions to view more details To export transaction activity over a period of time, select Download Activity and input a date range.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415725195027-Can-I-export-my-transaction-history", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415725195027.json", "title": "Can I export my transaction history?", "last_updated": "2024-03-26T10:16:46Z", "section_id": 115000306327, "body": "Yes, to export all transactions on your account, follow the steps below: Sign in to your Zipcar account Click on Billing in the top navigation menu Select Download Activity Input date ranges and download results", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415725362579-How-can-I-learn-more-about-my-unique-Zipcar-mobility-needs-for-my-larger-business", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415725362579.json", "title": "How can I learn more about my unique Zipcar mobility needs for my larger business?", "last_updated": "2023-12-16T01:33:58Z", "section_id": 4415725357075, "body": "If you require a m ore custom Zipcar solution for your business, fill out the form on our enterprise page . Once submitted, our Zipcar Enterprise Solutions Team will be in touch.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415730643603-Can-I-require-drivers-on-my-business-account-to-input-a-booking-memo", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415730643603.json", "title": "Can I require drivers on my business account to input a booking memo?", "last_updated": "2024-04-02T16:23:52Z", "section_id": 360004537873, "body": "As an owner or admin of an account, you can require all drivers to input a booking memo, or note, by following the steps below: Sign in to your Zipcar account Click on My Account at the top of the page and select Account Settings Select the Trip Memos card Select Memos required on all bookings Click Update to save your settings", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415730796819-How-do-I-drive-as-a-business-admin", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415730796819.json", "title": "How do I drive as a business admin?", "last_updated": "2022-09-30T16:32:22Z", "section_id": 4415629181203, "body": "To add driving privileges to an admin account, follow the steps below: Sign in to your Zipcar account Click on My Account at the top of the page and select Account Settings Select the People tab and search for the member's name Click the overflow menu (3 vertical dots) to the right of the member name Click Update role Select Driver as well as Admin You will be able to see the updated role change reflected on the account member list on the people page. Keep In Mind Only owners & admins of a business account can add driving privileges to an admin account", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415731021203-How-can-I-search-the-drivers-who-are-on-my-account", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415731021203.json", "title": "How can I search the drivers who are on my account?", "last_updated": "2024-01-25T14:14:17Z", "section_id": 4415629181203, "body": "To search the drivers on your account, follow the steps below: Sign in to your Zipcar account Click on My Account at the top of the page and select Account Settings Select the People tab Scroll to the bottom of the page to view a list of members on your account Alternatively, on the People tab you can search for an account member by entering their name or email address into the search bubble just above the member list", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4415732257043-How-can-I-bring-Zipcar-to-my-residential-property", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4415732257043.json", "title": "How can I bring Zipcar to my residential property?", "last_updated": "2023-05-25T04:21:14Z", "section_id": 4415725357075, "body": "If you require a more custom Zipcar solution for your business, fill out the form on our residential services page . Once submitted, our Zipcar for Residential Properties Team will be in touch.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4418317426067-Am-I-able-to-switch-my-current-membership-plan-to-a-promotional-plan", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4418317426067.json", "title": "Am I able to switch my current membership plan to a promotional plan?", "last_updated": "2025-08-18T16:00:39Z", "section_id": 360004537873, "body": "If you already have a Zipcar account with a standard membership plan and would like to change to one that is sponsored by a business or organization you are associated with, please contact us for assistance. Be sure to provide the name of the sponsoring organization and our support team will find the best available plan for you.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4527411557651-Why-do-I-have-an-authorization-pending-charge-or-hold-on-my-credit-or-debit-card", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4527411557651.json", "title": "Why do I have an authorization, pending charge or hold on my credit or debit card?", "last_updated": "2024-05-01T16:52:44Z", "section_id": 115000306327, "body": "When a Zipcar reservation, membership application, or account fee has been charged to the card on file, your bank may show the charge as pending or on hold. This is your bank's way of setting aside the spent funds while it prepares to transfer the funds out of your account. Once the funds have been fully transferred from your bank, the pending charge or hold will be removed. This process can take up to 3 - 5 business days, but will vary by banking institution.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4527546864915-Why-is-my-pending-charge-or-authorization-more-than-my-purchase", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4527546864915.json", "title": "Why is my pending charge or authorization more than my purchase?", "last_updated": "2024-02-28T16:26:33Z", "section_id": 115000306327, "body": "Typically, banks will set aside recent charges to your credit or debit card as a hold or pending authorization. However, some banking institutions may set aside additional funds or holds as it processes the transactions. Once the funds have been fully transferred from your bank, the pending charges or holds will be removed. This process can take up to 3 - 5 business days, but will vary by banking institution.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4527577810579-Why-do-I-have-multiple-holds-or-authorizations-on-my-credit-card", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4527577810579.json", "title": "Why do I have multiple holds or authorizations on my credit card?", "last_updated": "2024-03-07T15:04:29Z", "section_id": 115000306327, "body": "Typically, banks will set aside recent charges to your credit or debit card as a hold or pending authorization. Multiple pending charges, authorizations, or holds on your credit or debit card may appear if your Zipcar booking is modified. For example, extensions to your trip, purchases of additional insurance products, and other changes may result in additional holds or authorizations on your card. Once the funds have been fully transferred from your bank, the pending charges or holds will be removed. This process can take up to 3 - 5 business days, but will vary by banking institution.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/4724683794835-How-do-I-manually-grant-location-access-to-the-Zipcar-app", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/4724683794835.json", "title": "How do I manually grant location access to the Zipcar app?", "last_updated": "2024-04-11T17:05:22Z", "section_id": 115000306287, "body": "Before being able to unlock your car with the mobile app, there are some features that need to be enabled and some permissions that will have to be granted. Usually, we'll ask that you turn on these features and allow these permissions when you first use the app. If you're still having some challenges unlocking your Zipcar, check here for more troubleshooting tips. Apple iOS Go to your Settings app Find or search for Zipcar Under Location be sure it's set to While Using the App and Precise Location is enabled Bluetooth should be enabled Cellular Data should also be enabled as a fallback if Bluetooth doesn't work Google Android Open your Settings Go to the Apps section Under All Apps either find or search for Zipcar Select Permissions Select Location, tap Allow only while using the app and Use precise location is toggled on Need more help? iOS users can go here for more information from Apple Android users can go here for more information from Google", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/6280784143635-Why-does-it-say-invalid-when-I-enter-my-email-to-create-a-Zipcar-account", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/6280784143635.json", "title": "Why does it say invalid when I enter my email to create a Zipcar account?", "last_updated": "2024-03-10T01:04:54Z", "section_id": 115000305987, "body": "All email addresses that are not associated with a past Zipcar account and tied to a valid email platform should be accepted. Please ensure your email is typed correctly. For example, it should reflect name@domain.com Tip Are you still having trouble? Hit the contact us button to get in touch.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/6300069948691-Why-can-I-not-submit-my-Zipcar-application", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/6300069948691.json", "title": "Why can I not submit my Zipcar application?", "last_updated": "2024-04-12T15:55:34Z", "section_id": 115000305987, "body": "If you are trying to submit your application and are encountering an error, please try the following troubleshooting tips: Confirm the payment card being used is activated Confirm there are sufficient funds available on the payment card Note: Some merchants may authorize an additional pending charge to the account If the payment method you are using has tried to be authorized 5 times or more in the course of adding your payment method, then your card may be blocked. Please reach out to your banking institution to confirm the card has not been blocked Tip Are you still having trouble? Hit the contact us button to get in touch.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/6380973613331-What-account-security-measures-does-Zipcar-take", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/6380973613331.json", "title": "What account security measures does Zipcar take?", "last_updated": "2024-02-01T02:59:06Z", "section_id": 115000314608, "body": "At Zipcar, we take your safety and security very seriously. A Zipcar representative will never ask you for the following information: Complete payment card numbers Your password Two-factor authentication codes Any information that is not relevant to your Zipcar account If you receive calls, notifications, or emails from sources you are unfamiliar with regarding your Zipcar account, feel free to contact us directly by selecting Contact Us at the top of the page, or calling our customer support team. Note Zipcar does not offer any paid advertising incentives or opportunities for vehicle branding and is likely the actions of fraudulent actors", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/6381303515923-Why-can-I-not-submit-my-selfie-and-or-driver-license-photo", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/6381303515923.json", "title": "Why can I not submit my selfie and/or driver license photo?", "last_updated": "2024-03-09T02:36:48Z", "section_id": 115000305987, "body": "If you are having issues taking or submitting your selfie or driver's license, ensure the following is correct. All submitted photos must be clear; blurry or obstructed photos may delay your application Consider reviewing our eligibility requirements for driver's license requirements, if an ineligible driver's license is detected it will not be accepted If using a mobile device, please ensure you have given permission to take photos from the Zipcar app or mobile browser Tip Are you still having trouble? Hit the contact us button to get in touch.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/6381423438099-Why-am-I-having-trouble-applying-for-a-promotional-membership", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/6381423438099.json", "title": "Why am I having trouble applying for a promotional membership?", "last_updated": "2025-08-18T16:00:01Z", "section_id": 115000305987, "body": "If you are trying to apply for a promotional membership and are encountering an error, please try the following troubleshooting tips: Please use the promotional membership join link provided by the sponsor, if the join link is not working, please contact the sponsor of the membership If you are entering another promotion code at the checkout it may void the promotional membership, please do not enter another promotional code at the checkout Tip Are you still having trouble? Hit the contact us button to get in touch.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/6381719745555-Why-am-I-having-trouble-applying-for-a-University-membership", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/6381719745555.json", "title": "Why am I having trouble applying for a University membership?", "last_updated": "2024-04-14T12:41:53Z", "section_id": 115000305987, "body": "If you are trying to apply for a university membership and are encountering an error, please try the following troubleshooting tips: If you have signed up with your university email address under a traditional account please contact us so we can help correct your account Please check your spam and junk folders for the verification email, emails may take a few hours to reach your inbox. Please contact your university if no email is received Tip Are you still having trouble? Hit the contact us button to get in touch.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/6381951710867-Why-am-I-having-trouble-applying-for-a-Business-membership", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/6381951710867.json", "title": "Why am I having trouble applying for a Business membership?", "last_updated": "2024-04-17T20:15:10Z", "section_id": 115000305987, "body": "If you are trying to apply for a business membership and are encountering an error, please try the following troubleshooting tips: Please check your spam and junk folders for an email from Zipcar with your invitation link sent by your business owner or administrator If no email has been received in over 24 hours, please contact your business owner or administrator. Tip Are you still having trouble? Hit the contact us button to get in touch.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/6471781477395-What-is-the-refer-a-friend-promotion", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/6471781477395.json", "title": "What is the refer-a-friend promotion?", "last_updated": "2023-10-31T15:33:07Z", "section_id": 4415725357075, "body": "If you're looking to join Zipcar or have a friend that would like to join, our refer a friend promo allows existing members to refer a new member. Both the current and new member will receive $25 in driving credit after the new member has been approved. Click here to begin referring your friends to join Zipcar today. Keep In Mind This offer is limited to 10 rewards per member The terms and conditions of the offer can be found here", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/7141645364371-Why-was-I-moved-from-a-Student-Plan-to-an-Alumni-Plan", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/7141645364371.json", "title": "Why was I moved from a Student Plan to an Alumni Plan?", "last_updated": "2024-02-17T00:37:21Z", "section_id": 115000314608, "body": "Student memberships are provided through University Partners. Student memberships with Zipcar may be valid for up to 6 years. After your student membership has expired you will be moved to Zipcar’s standard alumni plan. Note If you are still in school and were moved, please contact us so we may assist your further and review your student eligibility", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/8686350067987-Why-do-you-ask-for-end-trip-photos", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/8686350067987.json", "title": "Why do you ask for end trip photos?", "last_updated": "2024-04-19T19:18:48Z", "section_id": 115000314548, "body": "The photo upload feature provides you with a quick way to report the condition you left the vehicle in. By doing so, it helps ensure that you’re not held responsible for a damage or mess that occurred outside of your trip window. In addition to protecting you from damage claims, end trip photos help the Zipcar team ensure any vehicle issues are addressed promptly so we can keep good members like you coming back to clean, well maintained cars.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/8915949288339-I-received-an-unknown-charge-how-can-I-tell-if-this-is-from-Zipcar", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/8915949288339.json", "title": "I received an unknown charge, how can I tell if this is from Zipcar?", "last_updated": "2024-04-01T03:11:13Z", "section_id": 115000306327, "body": "While we try our best to ensure the charges you incur are correctly labeled on your billing statements, sometimes there are bank limitations that may prevent a clear description of charges. If you see an unclear message on your credit card statement, such as “ MAY-I-Z-29599477-33 ” or “ JUL25 #14947870 ”. It might be your recurring charges ( e.g., membership fee, damage waiver, etc. ) or delayed trip charges ( e.g., violations ). Any charges will be reflected via your Zipcar account billing page or by email. If you have been charged and are not seeing any related billing activity please contact us by submitting a request so we may assist you.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/8952934605075-Why-are-check-in-photos-important", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/8952934605075.json", "title": "Why are check-in photos important?", "last_updated": "2024-04-30T13:00:20Z", "section_id": 115000306287, "body": "The photo upload feature provides you with a quick way to report the condition of the vehicle when your reservation begins. By doing so, it helps ensure that you’re not held responsible for a damage or mess that occurred outside of your trip window. In addition to protecting you from damage claims, photos help the Zipcar team ensure any vehicle issues are addressed promptly so we can keep good members like you coming back to clean, well maintained cars.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/9074896740371-I-am-a-business-member-how-can-I-open-a-personal-account", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/9074896740371.json", "title": "I am a business member, how can I open a personal account?", "last_updated": "2023-08-08T06:14:49Z", "section_id": 360004537873, "body": "Business members can have secondary personal accounts with Zipcar. Application fees are typically waived when opening secondary accounts. To open a secondary account, log in to your Zipcar account and follow the steps below. Navigate to your account settings and select view plans and pricing . Select the membership type that meets your needs - you can choose an annual or monthly personal plan . Follow the prompts to enter your driver's license information, personal details, and payment information (all membership & trip fees will be charged to this payment method) After your driving application is approved, you can reserve and drive cars on your personal account . Keep In Mind To toggle between your personal and business account, select the My Account at the top right-hand side of your screen. A drop-down menu will appear with your business name and your name. The business name is your business account, and your name is your personal account.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/9413864280595-I-have-a-business-account-how-do-I-join-my-family-s-personal-account", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/9413864280595.json", "title": "I have a business account, how do I join my family's personal account?", "last_updated": "2023-11-14T20:01:47Z", "section_id": 115000305987, "body": "Business members can also have personal accounts to drive with Zipcar. Application fees are typically waived when opening personal accounts. The family account holder will need to invite you via your business email You will receive an invitation link to join the family account. Click through the invitation link to sign into your account. After signing in, your account will reflect the family plan immediately. If you are not a driver on the business account, you must enter your driver's license to apply to drive. Your application to drive will be submitted after you confirm your license information. After your driving application is approved, you can reserve and drive cars on your family account. Keep In Mind To toggle between your personal and business account, select the My Account at the top right-hand side of your screen. A drop-down menu will appear with your business name and your name. The business name is your business account, and your name is your personal account.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/9514926539027-How-do-I-contact-Zipcar", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/9514926539027.json", "title": "How do I contact Zipcar?", "last_updated": "2026-01-12T23:23:35Z", "section_id": 115000314608, "body": "We want to provide you with the best support possible and there are a number of ways you can seek answers and reach us. Help Center You can search the Zipcar Help Center 24 hours a day, 7 days a week. Here you will find answers to the most commonly asked questions as well as a wealth of information related to all things Zipcar. You can search the Help Center by clicking here or from within the mobile app by clicking Account and selecting Help Center . Phone Support If you need help immediately, you can reach us on 866-4ZIPCAR (1-866-494-7227) and speak with an agent. If you are using the mobile app you can click on Account and select Call Zipcar . For those in an active reservation, phone support is available 24 hours a day, otherwise phone support is available from 8 am - 11 pm ET, 7 days a week. Chat You can reach our chat support option in the Zipcar app by clicking Account and scrolling down and selecting Chat or from our Help Center by clicking on the widget at the bottom right of the page. You will be greeted by our helpful chatbot who will assist you instantly. If your query is not resolved, and you need further help, you will have the option to be connected with a support agent. Chat support is available from 8 am - 11 pm ET, 7 days a week. Social Media You can send us a direct message on our social media accounts on Facebook , Twitter and Instagram and you will be connected with an agent who can assist you with your query. Support is available from 8 am - 11 pm ET, 7 days a week. Submit A Support Ticket Click here to open a support ticket from the Help Center or select Contact Us at the top of this page to get in touch. Be sure to provide a clear explanation of your request, including images if relevant. Please note it can take 2 - 3 business days to receive a response.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/10563876345235-I-changed-my-membership-plan-how-will-I-be-charged", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/10563876345235.json", "title": "I changed my membership plan, how will I be charged?", "last_updated": "2024-04-20T04:02:18Z", "section_id": 360004537873, "body": "When you change your membership plan, you'll be shown the date the new plan will take effect and how much you'll be charged. You are charged this new rate only when the new plan kicks in. If you change your plan within 30 days of your account becoming approved or reactivated, your changes happen immediately. You'll receive a refund for your previous membership fee and be charged for your new membership fee.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/10598788957075-Does-Zipcar-have-electric-vehicles-in-its-fleet", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/10598788957075.json", "title": "Does Zipcar have electric vehicles in its fleet?", "last_updated": "2024-02-27T22:34:23Z", "section_id": 4415635273491, "body": "Yes, Zipcar has begun to introduce electric vehicles into limited markets as part of an electrification pilot. Our members in these markets will have access to EVs as we collect feedback to help us successfully rollout more across our cities. To learn more about how to use our EV’s, visit our EV Guide or Help Center .", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/10979329417107-What-is-a-Daily-rate-only-booking", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/10979329417107.json", "title": "What is a \"Daily rate only\" booking?", "last_updated": "2024-04-18T10:42:54Z", "section_id": 4415635273491, "body": "Some vehicles have a daily rate booking only option, meaning there is no hourly rate available. These vehicles are great for longer bookings and you can book them for as long as you'd like. Keep in mind that each 24-hour period is charged at a single daily rate. For example, if you book for 36 hours, you will be charged 2x the daily rates. Remember, our daily rates may vary by day. Also, please note that you only have the car for the number of hours you book. So, if you book a car for 8 hours, the car will be subject to a late fee if you return it after that amount of time. You can find these vehicles by looking for the blue label. Tip Book your car for a bit longer than you may need within a 24-hour period, just in case, since your rate won't change.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/13235233152147-How-do-I-change-my-membership-plan", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/13235233152147.json", "title": "How do I change my membership plan?", "last_updated": "2025-08-18T15:59:30Z", "section_id": 360004537873, "body": "If you want to change your membership plan from monthly to annual, annual to monthly, or a university membership, you may do so by accessing your account settings on Zipcar.com. Go to your Account Settings page Click Your membership , then click Manage Plan to modify your membership You will then have the option to select a new membership plan Note: If you select a university membership, you will need to verify your student email address. Once you select the plan, you will be shown when the new plan will begin and the amount that will be billed Once submitted, you'll get a confirmation pop up Keep In Mind Membership plans can only be switched to monthly, annual, or university plans. If you want to switch to a promotional membership please contact us .", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/13617998694163-What-are-pay-by-plate-tolls-and-how-do-they-work", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/13617998694163.json", "title": "What are pay-by-plate tolls and how do they work?", "last_updated": "2025-05-16T15:52:27Z", "section_id": 4415635273491, "body": "Zipcar now uses the pay-by-plate method to calculate toll charges. When you drive through a toll lane, a camera captures your license plate and the toll is billed to your account. You’ll typically see the charge on your invoice within 2–3 weeks. As of January 2024, the Delaware River Joint Toll Bridge Commission expanded pay-by-plate service to seven of its older toll bridges, which previously accepted only E-ZPass or cash. If you approach a toll plaza with only E-ZPass or cash lanes, simply drive through the E-ZPass lane. You’ll still be charged using the pay-by-plate method. Keep In Mind The New York City congestion toll features a unique discounted rate available to Zipcar members under a specific agreement with New York City. This rate may differ from the amounts displayed while traveling through the area. For more details on our current congestion toll rates, please refer to the article: Why was a congestion charge toll added to my reservation?", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/13623855063827-Can-I-use-my-own-toll-pass-in-a-Zipcar", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/13623855063827.json", "title": "Can I use my own toll pass in a Zipcar?", "last_updated": "2024-04-17T14:24:34Z", "section_id": 115000306187, "body": "We do not recommend using your own Toll Pass in Zipcars since tolls are calculated by the Zipcar license plate and are non-refundable. This ensures you will not receive two charges for the tolls and will just receive the single toll charge in your Zipcar invoice.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/13941403219987-How-do-I-start-my-EV-trip", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/13941403219987.json", "title": "How do I start my EV trip? ", "last_updated": "2024-02-17T02:38:28Z", "section_id": 15518127267347, "body": "Start your EV trip like any other Zipcar by using the app. Unlock the car, then do the damage and cleanliness report. Your location will be a Charging Home Location or Non-Charging Home Location. If it’s a Charging Home Location , there is a charging station at the Zipcar home parking spot, and you will need to unplug the charging cable from the car to begin your trip. If it’s a Non-Charging Home Location , there is no charging station at the Zipcar home parking spot, and you do not need to unplug. Here's How to Unplug: After starting your trip, remove the charging cable by pressing the button on top of the cable and pulling (this may require a little bit of force). Return the cable to the charging station and remember to close the charging door on the car. Hop in and push the EV’s start button. Press the brake and turn the gear dial or buttons on the shifter to put it in Reverse or Drive. Look at the dashboard to see your range—that’s how far you can drive until you need to find a charging station to juice up. Keep In Mind: Check what type of home location your EV is parked in by looking at the location details in your reservation. Driving ranges are an estimate and may vary based on a variety of factors, including, but not limited to, driving conditions, driving habits and weather. Cold weather, fast driving, and using the AC or heat will slightly reduce your range.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/13941642934163-How-do-I-end-my-EV-trip", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/13941642934163.json", "title": "How do I end my EV trip?", "last_updated": "2023-10-18T23:56:46Z", "section_id": 15518144194963, "body": "Returning an EV is the same as any other Zipcar, except you must plug the car in before ending your trip if it's parked at a Charging Home Location . Here’s the details: Return your car to the same location you picked it up from. Your location will be a Charging Home Location or Non-Charging Home Location . If it’s a Charging Home Location , there is a charging station at the Zipcar home parking spot, and you will need to plug the car in at the end of your trip. If it’s a Non-Charging Home Location , there is no charging station at the Zipcar home parking spot, and you do not need to plug the car in at the end of your trip. Here’s how to plug your car in and end your trip: Park in a spot with an EV charging station. You’ll need to keep the car unlocked to access the charging port. So don’t lock up or end the trip quite yet! Grab the charging card from the visor and follow the directions on the charging station to plug in. Once your car’s plugged in, return the charging card to the visor. You’ll know the car is charging when the red charge icon in the dashboard lights up. Once it does, you can clean up and take all your stuff with you. Then lock the doors and end the trip in the app. Quick Tip Check what type of home location your EV is parked in by looking at the location details in your reservation.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/13941765762451-How-can-I-find-a-charging-station-during-my-trip", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/13941765762451.json", "title": "How can I find a charging station during my trip? ", "last_updated": "2023-10-14T19:10:21Z", "section_id": 15518127416211, "body": "Use the Plugshare app (or website) or Google Maps to find one along your route. Filter for charging stations with Level 2 (J-1772) or Level 3 (CCS/SAE) connectors and the same brand as the car’s charging card, or existing accounts you have. Some things to keep in mind: Level 3 (CCS/SAE) charging stations are much faster but harder to find. They’re often found along highways. 80% of charging stations are Level 2 (J-1772). Plan on spending at least 1-2 hours to get a decent charge. The charging card in the EV is brand specific—it only works at charging stations with the same brand or their partners. You can charge at any station, but you’ll have to submit receipts for reimbursement if it’s a different brand from the EV’s charging card. Charging takes time. So make sure your reservation is long enough to recharge and drive back to the car’s home location. You can extend in the app or via SMS. Keep In Mind Charging times are an estimate and may vary based on a variety of factors, including, but not limited to, vehicle model, driving conditions, driving habits and weather.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/13941901584915-How-do-I-use-the-charging-card", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/13941901584915.json", "title": "How do I use the charging card?", "last_updated": "2023-12-20T16:16:18Z", "section_id": 15518127416211, "body": "Each charging station is different, but you can count on a few things: You’ll need a charging card for the Chargepoint or SemaConnect brands. You might need to download their apps for the station—Flo or EVgo. You can’t pay with cash or your credit card like at the gas station. Each charging station has instructions on the station or onscreen. The charging station will let you know if the car’s charging. And the red charge icon in the car’s dashboard will also turn green. Some stations may ask you to pay for parking. We don’t reimburse for parking during a trip. A Level 2 charger takes about an hour to add 30 miles or 10% of battery life in a Kia Niro. * When you lock the car, the charging cable locks into the port. It will keep charging, even if you walk away. If you get an error, don’t panic. Try repeating the last step or starting over. Remember to return the charging card to the visor or cup holder. You’ll need it to plug in the car when you return. Keep In Mind Charging times are an estimate and may vary based on a variety of factors, including, but not limited to, vehicle model, driving conditions, driving habits and weather.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/13942010338195-What-happens-if-I-run-out-of-charge", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/13942010338195.json", "title": "What happens if I run out of charge?", "last_updated": "2023-12-31T23:40:22Z", "section_id": 15518127416211, "body": "Don’t worry! Your EV will give you an estimate of how many miles you have left throughout your trip. It changes depending on how fast you drive, the outdoor temperature and whether the heat or AC is on. You can recharge any time, but if you’re below 10% look for a charging station ASAP. Unlike gas cars, there’s no reserve tank. Once the charge level hits zero, the EV will stop running. So don’t risk it. If your battery runs out, call us at 866-4Zipcar and wait until roadside service gets there to tow the EV to the closest charging station. This could add 2–3 hours to your trip on top of the cost of the tow. If you need help finding a charging station download the Plugshare app or use Google maps or Plugshare online to find the closest location.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/13942051940499-Can-I-take-a-long-trip-in-an-EV", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/13942051940499.json", "title": "Can I take a long trip in an EV?", "last_updated": "2024-01-31T23:38:20Z", "section_id": 15511000622099, "body": "Yes! But you should plan ahead for charging. Make sure you know: The difference between Level 2 and Level 3 charging The type of charging stations along your route (Use an app like Plugshare or Google Maps to plot your trip.) What brand of charging card is in the EV You can use brands that are not compatible with our charging card, but make sure to download their app and set up an account to make the actual charging experience more seamless. And remember to add enough time in your reservation to charge if you plan to take a long trip.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/13942058338451-What-does-Zipcar-expect-from-me-during-my-EV-trip", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/13942058338451.json", "title": "What does Zipcar expect from me during my EV trip?", "last_updated": "2023-12-01T01:49:15Z", "section_id": 15511000622099, "body": "EV trips have the same rules as all our cars: Be back on time. Clean up before you go. Plug-in at the end of your trip to charge it for the next member. And remember - while you don’t need to return the EV at a minimum charge, don’t press your luck. When the battery gets to zero, the car will stop and you’ll need to be towed to a charging station.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/13942114533139-What-is-the-minimum-charge-I-must-return-the-EV-with", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/13942114533139.json", "title": "What is the minimum charge I must return the EV with?", "last_updated": "2024-03-01T10:27:49Z", "section_id": 15511000622099, "body": "Right now, there’s no minimum charge you need to return with since it will recharge as soon as you plug in at the home location. EVs can’t run on fumes (0% means 0%), so we suggest leaving at least 15% of charge for your return trip in case you hit traffic or make unexpected stops. Plus, that helps make sure the car’s charged for the next member, too.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/13942155106451-Do-you-reimburse-for-charging-costs", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/13942155106451.json", "title": "Do you reimburse for charging costs?", "last_updated": "2024-03-26T18:04:13Z", "section_id": 15518127416211, "body": "All EVs come with a charging card you can use to recharge the battery. The charging card will work at the home location and other charging stations with the same brand. What we reimburse: The charging costs if you pay to use a different brand of charging station during your reservation Some brands use a wallet-based system with a minimum setup charge. We’ll reimburse that amount, plus the charging fees. What we don’t reimburse: The cost of the time to charge during a reservation. When booking, please plan to charge the EV if you’ll be driving more than 40-50 miles. Parking costs at a charging station during a reservation.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/13942211220371-What-is-regenerative-braking", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/13942211220371.json", "title": "What is regenerative braking?", "last_updated": "2024-02-29T17:47:41Z", "section_id": 15518144046355, "body": "Kia Niro's have paddles on the steering wheel that control the regenerative braking feature. When it’s set to HIGH, the car will slow down more quickly when you take your foot off the gas. And it uses the resistance of braking to produce a small amount of electricity to recharge the battery. If you prefer smoother braking, use the paddles to tune the braking to LOW .", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/15286509458195-What-if-the-charging-card-is-missing-from-the-visor", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/15286509458195.json", "title": "What if the charging card is missing from the visor?", "last_updated": "2024-02-12T20:16:51Z", "section_id": 15518144274707, "body": "Don’t worry, we’re here for you. If you notice the charging card is missing at the start of your trip, contact us immediately, and we’ll find another car for you. If you don’t notice it’s missing until you’re already on the road, contact us when you return to the car’s home location, so we can help you end the trip correctly. Remember, without a charging card, you won’t be able to plug in your EV at the home location.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/15286534299667-Where-can-I-use-the-charging-card", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/15286534299667.json", "title": "Where can I use the charging card?", "last_updated": "2023-04-05T21:24:29Z", "section_id": 15518144274707, "body": "Most of our EVs come with Chargepoint charging cards that work at any Chargepoint charging station. When you use this card, it will bill us directly. Plugging in at a different station? Just submit your receipt — including date, time and amount — and we’ll reimburse you. Use the Plugshare app (or website) or Google Maps to charging stations on your route. Look for stations that are compatible with J-1772 or CCS/SAE connectors. Most Level 2 or Level 3 charging stations that are not Tesla branded should work for your car. Level 2 Stations – AC charging (J-1772 connectors) and make up 80% of public chargers. Level 3 Stations – DC charging (CCS connectors) and charge much faster.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/15286564142611-How-do-I-charge-my-EV", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/15286564142611.json", "title": "How do I charge my EV?", "last_updated": "2024-04-28T21:21:23Z", "section_id": 15518127416211, "body": "Just follow these steps: Plug in your EV at the charging station. Follow the on-screen instructions. Check the base of the windshield for three green lights to indicate it’s charging. If there are no green lights, double-check to make sure that you didn’t miss any steps while charging, which may include pressing a start button or tapping the charging card against the station.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/15286572551187-Where-s-the-charging-door-and-how-do-I-open-it", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/15286572551187.json", "title": "Where’s the charging door and how do I open it?", "last_updated": "2023-10-13T00:20:38Z", "section_id": 15518144274707, "body": "On the Kia Niro, the charging door is on the front, near the headlights. On the Chevrolet Bolt, the charging door is on the side. Gently press the charging port door to open it. If it doesn’t open, make sure the vehicle is unlocked, as the charging door automatically locks when the vehicle is locked.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/15286607620627-How-do-I-unplug-the-charging-cable", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/15286607620627.json", "title": "How do I unplug the charging cable?", "last_updated": "2024-03-08T07:03:19Z", "section_id": 15518127267347, "body": "First, follow the on-screen instructions at the station to stop the charging process. Then, unlock your vehicle, which allows you to remove the charging cable from the vehicle’s charging port. Remember to press the button on the cable to release it and plug it back into the charging station when you’re done.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/15286662379027-What-if-I-can-t-plug-in-the-car-at-the-end-of-my-trip", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/15286662379027.json", "title": "What if I can't plug in the car at the end of my trip?", "last_updated": "2023-04-05T21:24:49Z", "section_id": 15518144274707, "body": "First, check that you turned the EV off and the doors are unlocked. Do not end your trip yet. Then, gently press the charging port door near the headlights to open it. When you’re plugging in, make sure the charging cable is correctly aligned with the port holes. If the charging station is giving you an error, try tapping your charging card again. That usually fixes it. After plugging in and returning the charging card to the visor, end your trip. If your trip screen is no longer active in your Zipcar app or if you’ve ended your trip, reach out to us for help.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/15286668323091-What-if-the-designated-Zipcar-EV-parking-space-is-taken", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/15286668323091.json", "title": "What if the designated Zipcar EV parking space is taken?", "last_updated": "2024-04-02T16:56:20Z", "section_id": 15518144274707, "body": "Don’t worry, just park in any available Zipcar spot at that location and contact us. Having trouble figuring out which spot is yours? It’s in the Zipcar app on the My Trips tab under View Details . You can also check your booking confirmation email. Your Zipcar app is also great for other troubleshooting tips, including what to do if the parking garage is closed, an entry parking pass is missing, or if you're having an issue with the valet parking.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/15286670385811-What-if-the-charging-cable-is-stuck", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/15286670385811.json", "title": "What if the charging cable is stuck?", "last_updated": "2023-04-05T21:24:58Z", "section_id": 15518144274707, "body": "Sometimes the charging cable can be a little tricky. Make sure that: You’ve stopped charging. You’ve unlocked the EV. You’re pressing the release button on the charging cable. If this still doesn’t work, try pulling the cable a little harder.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/15286772504595-How-far-can-I-go-in-an-EV", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/15286772504595.json", "title": "How far can I go in an EV?", "last_updated": "2024-02-29T17:47:07Z", "section_id": 15518143938323, "body": "When determining an EV’s range – weather, speed, AC/heater use and other factors can all contribute to battery levels. To be on the safe side, here’s what to expect per 25% of charge*: 50 miles in normal conditions 40 miles when it’s below freezing * Driving ranges and charging estimates are estimates and may vary based on a variety of factors, including, but not limited to, vehicle model, driving conditions, driving habits and weather. See the chart below for driving estimate ranges per charging level. Charge % Level Distance to empty (miles)** **Driving ranges are an estimate and vary based on a variety of factors, including, but not limited to, vehicle model, driving conditions, driving habits and weather. Estimates based on the 2022 Kia Niro in cold and mild weather. Cold Weather (20ºF and lower) Mild Weather 100% 165 miles 212 miles 75% 123 miles 159 miles 50% 82 miles 106 miles 25% 41 miles 53 miles", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/15286842250131-Why-do-charging-stations-have-6-5-kW-or-50-kW-as-part-of-their-description", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/15286842250131.json", "title": "Why do charging stations have \"6.5 kW\" or \"50 kW\" as part of their description? ", "last_updated": "2023-04-05T21:24:35Z", "section_id": 15518144274707, "body": "kW measures the amount of electric flow through a charging connection. It’s also how to determine if a charging station is Level 2 or Level 3. Level 2 stations range from 6.5kW to 19.2kW. Level 3 stations are anything higher than 19.2kW—with the most common wattage being 50kW. The higher the kW, the faster your EV will charge.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/15286845403155-How-can-I-find-and-book-an-EV", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/15286845403155.json", "title": "How can I find and book an EV?", "last_updated": "2024-12-18T00:05:44Z", "section_id": 4415635273491, "body": "It’s easy. In the Zipcar app, just search by “Car Type” and select “Electric”. Or simply look for the lightning bolt next to cars in your area!", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/15286863607059-How-fast-do-EVs-charge", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/15286863607059.json", "title": "How fast do EVs charge?", "last_updated": "2023-10-29T13:35:11Z", "section_id": 15518127416211, "body": "How fast an EV charges depends on the type of charger it’s plugged into. There are two types of chargers: Level 2 and Level 3. The higher the kilowatts on the charger, the faster the car will charge. Level 2 chargers (6.5 kW – 19.2kW) – A 7.2 kW charger can add up to around 18 miles of range per hour*. Level 3 chargers (50 kW and above) – These chargers can add about up to around 135 miles of range per hour*. While Level 3 charging stations are much faster, they are harder to find. You can usually locate them near highways. *Charging times are an estimate and may vary based on a variety of factors, including, but not limited to, vehicle model, driving conditions, driving habits and weather. Use the Plugshare app or Google Maps to find charging stations along your route. See the chart below to learn more about each type of charger and how quickly they will charge an EV. Level 2 (Ac Charging) Level 3 (DC Charging) Overview Most common charging stations Fast charging stations Kilowatts / Power Range 6.5kW - 19.2kW 50kW and greater Plug Type AC Connector: Type 1 – J1772 DC Connector: CCS Combo 1 Vehicle Charging Port Some Benchmark Estimates* *Charging times and expected driving ranges are estimates and may vary based on a variety of factors, including, but not limited to, vehicle model, driving conditions and habits, weather, and charging station. Power Rating 7.2 kW 50 kW 30 min of Charge 9 miles 68 miles 45 min of Charge 14 miles 101 miles 60 min of Charge 18 miles 135 miles", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/16310509570067-How-do-I-pause-my-membership", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/16310509570067.json", "title": "How do I pause my membership?", "last_updated": "2024-04-15T16:30:27Z", "section_id": 4415725357075, "body": "We know that sometimes you need to take a break and hit pause on your Zipcar membership rather than cancelling it altogether. And that's A-OK with us! You can pause your monthly membership for up to three months, allowing you to take a breather without saying goodbye. So go ahead and hit that pause button - we'll be here when you're ready to get back on the road! To pause your monthly membership: Log in to your Zipcar account on the website or mobile app Go to My Account and click on your membership plan Click Cancel Membership , and you'll be prompted to pause your membership for up to three months Pick the timeframe for the pause period that works for you Click Pause Membership and you're all set Your membership will be paused during the selected period and you won't be charged for any usage. When the pause period ends, your membership will automatically reactivate, and you can start using Zipcar again. Keep In Mind Annual memberships are unable to be paused Damage protection that is cancelled or charged in the pause period is non-refundable If you have a monthly damage protection plan, it will also be paused unless you choose to cancel it If you purchased an annual damage protection plan and decide to pause your membership, it will be cancelled Additional trip costs, such as tolls and violations from past trips, will be charged if received during the pause period A paused membership can be reactivated on your account page Any trips previously booked during the pause period will be cancelled", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/18854133055123-Can-I-opt-out-of-facial-recognition-during-the-application-verification", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/18854133055123.json", "title": "Can I opt out of facial recognition during the application verification?", "last_updated": "2024-03-18T00:44:59Z", "section_id": 4415725357075, "body": "Applicants with a Texas or Illinois driver's license, or applying in markets in either state, can opt out of facial recognition during the application process. It's easy to do – check the box that says \"Opt-out of facial recognition\" at the end of the verification section when applying to join Zipcar. By opting out, your application will be manually reviewed, which may take up to 3 business days. So, no worries if it takes a bit longer; we'll still make sure to process your application. We hope to see you on the road soon!", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/19342450673811-What-type-of-gas-should-I-put-in-my-Zipcar", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/19342450673811.json", "title": "What type of gas should I put in my Zipcar?", "last_updated": "2024-01-17T13:54:59Z", "section_id": 360004492634, "body": "You may have to fill up your Zipcar while driving, so knowing what fuel to put in is important. The majority of our cars should be filled with Regular Unleaded/87 Octane gasoline. Our luxury class vehicles, such as Mercedes and BMWs, should be filled with Premium Unleaded/91-94 Octane gasoline. You should never put diesel into any of our cars as this can cause severe and permanent damage to the engine. Diesel nozzles can usually be identified by their green color. Keep In Mind You should always return your Zipcar with at least 1/4 gas.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/22158011456403-How-can-I-request-my-Zipcar-account-be-deleted", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/22158011456403.json", "title": "How can I request my Zipcar account be deleted?", "last_updated": "2026-01-12T23:44:25Z", "section_id": 115000314608, "body": "Did You Know? You can pause your monthly membership for up to three months or cancel your membership entirely rather than deleting your account. For more information, check out this article . Account deletion can be a significant decision, and we're here to guide you through the process. Below you will find step-by-step instructions on submitting an account deletion request. Android & iOS Log in to your Zipcar account on the mobile app Go to My Account and select Privacy and Legal Click Delete account Confirm you would like to delete your account or cancel your membership Review the terms of requesting account deletion, acknowledge the request, and click Delete account Web Browser UK Members If you are a member in the UK, please see this article for information on processing account deletion requests. Open the deletion request page You can then choose to cancel your membership or delete your account Review the terms of requesting account deletion, acknowledge the request, and click Delete account Keep In Mind Once your account deletion request has been submitted, you can no longer access your Zipcar account Account deletion requests can only be requested if you are not in an active Zipcar trip To reverse your account deletion request, please refer to: I requested to delete my account — can I undo it? Any future trips will be cancelled and refunded automatically after submitting a deletion request", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/24250163035923-How-can-I-update-my-phone-number-if-I-no-longer-have-access-to-the-original-number", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/24250163035923.json", "title": "How can I update my phone number if I no longer have access to the original number?", "last_updated": "2024-04-27T23:57:58Z", "section_id": 360004537873, "body": "Are you experiencing issues with your Zipcar account because of a lost or changed phone number? We've got your back. To regain access and update your phone number, let's verify your identity. Email us at account-recovery@zipcar.com with these details: Emailing us from your current Zipcar account email Your past phone number on your Zipcar account The new phone number you want to use Explain the issue preventing login or phone number update Snap a clear photo of your driver's license (matching your account) Take a picture holding your license (showing your face and the license) If your license address differs, send a matching document (utility bill, etc.)", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/25850089756435-What-are-Zipcar-s-current-promotions", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/25850089756435.json", "title": "What are Zipcar's current promotions?", "last_updated": "2026-01-28T15:58:26Z", "section_id": 115000314608, "body": "Zipcar regularly offers discounted booking promotions to eligible members. Discounts can be applied at checkout by selecting available promotions or inputting a unique promotional code received. More information on how to redeem booking promotions can be found here . Active driving promotions and their Terms & Conditions can be found below. January Midweekday Promo: Valid on reservations 4 hours or longer that take place on Tuesdays, Wednesdays or Thursdays between 1/20/26 at 12:00 a.m. EST and 2/5/26 at 11:59 p.m. EST. Reservations must end no later than 11:59p.m. EST on 2/5/26. Reservations on Fridays, Saturdays, Sundays, or Mondays, and any reservation that begins before 1/20/26 or ends after 2/5/26, will not qualify for any discount, and the entire reservation will be billed at regular rates. Valid for hourly and daily rates and has no cash value. Promo cannot be combined with Zipcar rewards or any other offer. Zipcar may change or revoke the discount any time. $20 Off Because We Miss You: Promotion is valid for select members on reservations booked within 21 days. Valid for daily or hourly rates only and has no cash value. $9 Off Welcome Back: Promotion is valid for select members on reservations booked within 30 days. Valid for daily or hourly rates only and has no cash value. $25 Off Your Next Ride when you renew: Promo valid only for recipients of this email. Must be redeemed at checkout within 30 days of issue date. Valid for daily or hourly rates only and has no cash value. Zipcar may change or revoke the discount at any time. Promo cannot be combined with Zipcar rewards or any other offer.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/35584368335379-Can-I-use-Apple-or-Google-Pay", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/35584368335379.json", "title": "Can I use Apple or Google Pay?", "last_updated": "2025-08-25T15:50:03Z", "section_id": 115000306327, "body": "Google and Apple Pay can be used for the initial reservation but not for membership fees, post-booking trip charges, or trip-related expenses such as tolls. A default card must be on file for these costs. Ensure Google or Apple Pay is set up on your device to use it for booking. Mobile App Instructions While on the Zipcar mobile app, once you have selected your desired reservation details (including any per-trip protection or liability insurance ) proceed to the Payment section and tap on your current payment method to make changes. On the next screen, select Google Pay or Apple Pay. If Google Pay or Apple Pay does not appear as an option, it means the Google Pay or Apple Pay wallet has not been set up on your phone. Once you have selected Google Pay or Apple Pay, click done to return to the checkout. Once you return to checkout, scroll to the bottom of the page to pay with Google Pay or Apple Pay and complete your booking.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/36395167077267-Why-was-a-congestion-charge-toll-added-to-my-reservation", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/36395167077267.json", "title": "Why was a congestion charge toll added to my reservation?", "last_updated": "2025-01-06T15:57:28Z", "section_id": 115000306327, "body": "As of January 5, 2025, New York City has implemented a congestion charge within the designated congestion zone. Zipcar members and drivers will be subject to this charge, which is based on either off-peak or peak pricing. Peak periods for the congestion zone are weekdays 5AM - 9PM and weekends 9AM - 9PM with a toll rate of $9.00 . A toll rate of $2.25 will be in effect during off peak hours. Keep In Mind Congestion prices and peak periods are subject to change. More information can be found here .", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/40738997629075-I-was-in-an-accident-What-should-I-expect-during-the-accident-process", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/40738997629075.json", "title": "I was in an accident. What should I expect during the accident process?", "last_updated": "2025-05-28T19:57:56Z", "section_id": 4415790262035, "body": "We understand that being in an accident can be stressful and overwhelming. To help provide some clarity, here’s how our accident process works: Complete the Accident Report: After you report the accident, we’ll send you an accident report via text message that must be filled out and submitted. While we wait for your completed report, your Zipcar account will remain suspended. Once we receive your report, we will review your account and update you on the status of your suspension within 3 business days. Zipcar Reviews Damage and Liability Claims: Our teams will assess and review any damage or liability claims related to the incident. This process can take several weeks. While we gather and review the necessary information, you may not hear from us right away, but rest assured, we are actively working on your case. We will follow up with you as soon as we reach the next step in the process. Billing Follow-up: Once all claims and damage assessments are complete, we will reach out to you to discuss any applicable damage fees or third-party claims and finalize the billing details. Here are some things to know or keep in mind as we process the accident report: Account Status: Your Zipcar account will be suspended while we await your incident report. Once we receive your report, we will review your account and provide an update on your suspension within 3 business days. Vehicle Inspection: Zipcar will assess the vehicle for any damage and arrange for necessary repairs. Damage Fees: If there is no breach of contract, can be up to $2500; if a waiver was purchased, your damage fee may be less. For more information on damage fees, please refer to Is there a damage fee if I damage a Zipcar vehicle? Liability Provider: Zipcar’s claims administrator, Sedgwick CMS, handles our liability claims. You can reach them at 866-345-2474 for assistance", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/41253143723155-How-do-I-undo-my-account-deletion-request", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/41253143723155.json", "title": "How do I undo my account deletion request?", "last_updated": "2026-01-12T23:44:35Z", "section_id": 360004537873, "body": "If you requested to delete your Zipcar account, you have 30 days from the request date to reverse this decision. How to undo your account deletion request Locate the deletion confirmation email sent to you on the date you requested to delete your account In the email, scroll to the bottom and select Undo deletion Confirm your decision by selecting Restore Now A success message will appear, confirming that your account has been restored", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/41811742741779-What-is-the-Zipcar-Rewards-program-and-how-does-it-work", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/41811742741779.json", "title": "What is the Zipcar Rewards program and how does it work?", "last_updated": "2025-11-05T16:42:53Z", "section_id": 360004492614, "body": "What is the Zipcar Rewards program, and how does it work? Zipcar Rewards is a program in which our standard membership has been pre-enrolled to earn discounts on future trips. For eligible consumer members, every $250 spent on eligible bookings—including driving rates and mileage but excluding taxes, tolls, ancillary fees, late returns, and violations—you’ll receive $5 in rewards. Eligible university members have a student rate of $5 in rewards for every $200 spent. Who qualifies for the Zipcar Rewards program? Zipcar Rewards is currently available to eligible consumer and university members. If you're eligible for the program, you'll see a Rewards tab in your account overview or on the Zipcar App navigation bar Can I still earn rewards when I use a reward on a trip? Yes, if your trip cost is more than the reward redemption you may be able to earn rewards on a trip in which you use a reward. In example, if your trip cost is $50 before taxes and fees and you redeem $45 in rewards you would earn $5 spend toward your next reward. Which charges count toward earning Zipcar Rewards? Only driving rates and mileage charges count toward earning Zipcar Rewards. Other fees and charges do not qualify. Rewards will not be earned for trips that violate community rules—such as returning late, leaving low fuel, or not maintaining interior cleanliness. What are the terms and conditions of the Zipcar Rewards program? For full details, please visit our Terms and Conditions page . Can I combine my rewards with other promotions or discounts? At this time, rewards cannot be combined with promotions or discounts that require a promo code at checkout. Do my rewards ever expire? Redeemed Rewards: Once you redeem a reward, it must be used within 30 days. Earned Rewards: Your reward balance expires 12 months after your most recently earned reward. For example, if you earned $5 in February and another $5 in March, the full $10 expires in March of the following year. If you earn more later, your expiration date extends accordingly. Rewards Progress: If you don’t take a trip for 12 months, your progress toward earning rewards will reset. Taking at least one trip a year keeps your progress active. Where can I check my rewards balance and available offers? You can check your reward balance on the Mobile App or Website. To check your rewards in the Zipcar mobile app: Open the app and sign in to your account. You'll see a Rewards tab at the bottom of the screen. Tap it to view details about your rewards, including pending, earned, and redeemed amounts. To check your rewards on the Zipcar website: Log in to your account and look for the small Rewards icon next to your account icon in the top right corner of the homepage. Click it to view your pending, earned, and redeemed rewards. To check your rewards on the Zipcar mobile website: Sign in to your account and tap the menu icon in the top-left corner of the screen. A menu will pop up, and you’ll see the Rewards option, where you can view any available rewards. How do I use or redeem my Zipcar rewards? You can redeem your Zipcar rewards either from your Rewards page or during checkout. To redeem at checkout: Select “Add Promo or reward” during the checkout process. Your available dollar-off reward will appear—select “Redeem.” A confirmation prompt will appear. Select “Redeem and Apply” to use the reward for your booking. If you've already redeemed the reward, simply choose “Apply” to add the discount to your reservation. You’ll see confirmation that the reward has been applied on the Promotions and Rewards page. Click “Done” to return to checkout and complete your booking. To redeem on your Rewards page: On your Rewards page, click the \"Redeem\" button next to your total earned rewards. A prompt will appear asking if you'd like to redeem your rewards and proceed with booking by selecting “Redeem & Book”. You’ll be directed to the search page to choose a car and time that best fits your needs. Your rewards will be automatically applied at checkout, so there's nothing you need to do—just book and enjoy the savings. Keep In Mind Please update your Zipcar app to the latest version to check your eligibility for our program.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/43304294953619-How-I-obtain-a-Zipcar-for-Uber-rideshare-permit-emblem-to-complete-rider-pickups-at-MSP-airport", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/43304294953619.json", "title": "How I obtain a Zipcar for Uber rideshare permit & emblem to complete rider pickups at MSP airport?", "last_updated": "2025-10-23T20:52:38Z", "section_id": 360004492614, "body": "Rideshare drivers who wish to pickup or dropoff passengers at Minneapolis-St Paul International Airport (MSP) must obtain a permit and display an emblem. Failure to do so will result in a fine levied against the driver. Obtaining A Permit Go to tncpermit.mspmac.org Fill out the MSP Airport permit form online—you will need to have your social security number & vehicle VIN Ensure your driver’s license is current and all documents are up-to-date At Your Permit Appointment Show your driver's license Verify that you are an active user on your app Show a copy of your current vehicle inspection (see attachments below) A permit fee of $25 per TNC will be charged by debit or credit card (cash will not be accepted) Verify and sign a copy of the form you submitted Airport staff will verify your information and provide you a decal for each vehicle as well as a paper driver's permit After Your Permit Appointment Apply the decal to your windshield. MAC ordinance requires the decal to be affixed on the middle of your windshield behind your rearview mirror.  Apply it so you easily remove it from the vehicle when your trip is complete! Carry your paper driver’s permit with you or upload a photo of the permit to your app (if applicable) under “MSP Airport Permit” Remove the decal from the windshield upon completion of your Zipcar for Uber trip", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/43872745996179-What-is-the-Zipcar-Membership-Beta", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/43872745996179.json", "title": "What is the Zipcar Membership Beta?", "last_updated": "2025-08-18T15:51:20Z", "section_id": 360004492614, "body": "We’re introducing a new membership beta program to give members more flexibility and perks . In addition to our Standard plan, select members can now choose from two new plans: Lite ($5/month) or Plus ($19/month) . What is the Membership Beta? The Membership Beta allows select members to join one of our new plans: Lite or Plus . These plans are designed to fit different driving needs—whether you drive occasionally or often. Lite : Best for local, occasional trips. Monthly only offering . Standard : Our always-on membership offering, with options for monthly or annual memberships . Plus : Perfect for frequent drivers looking for extra value and perks. Monthly only offering . If you are an existing Zipcar member , you’ll see the new plans available when managing your plan in the Membership section of your Account Settings . What do I get with the Lite and Plus plans? Lite ($5/month) 50 miles/day included Gas & secondary insurance included Cancellation requires 24 hr. advance notice No additional drivers Plus ($19/month) 300 miles/day included Gas & secondary insurance included 15-minute early access to trips $10 monthly driving credit (expires each month) 1 additional driver included + up to 2 more at 50% off Flexible trip cancellation (same-day for trips under 8 hours, 24 hours for longer trips) Can I change plans during the beta? Yes! Members can self-service plan changes through their Zipcar account. Upgrading : When moving to a higher plan (Lite → Plus), the amount you already paid for the lower plan will be prorated toward your upgrade. Downgrading : When moving to a lower plan (Plus → Lite), the change will take effect at the next billing cycle . Can I stay on my current Standard plan? Absolutely. If you’re happy with your Standard plan , no action is needed. You can switch to Lite or Plus anytime during the beta if you want to explore the new benefits. How do I add extra drivers? Lite plan members cannot add any additional drivers to their account. Standard members can add up to 1 additional driver at 50% off the monthly membership cost. Plus plan members can add up to 3 additional drivers to their account. The first driver will be at no additional membership cost, the second and third drivers will be at 50% off the month membership plan cost. How does the $10 monthly driving credit work on Plus? We’ll add your $10 driving credit to your account on the first day of your billing cycle. You can use it on any reservation, as long as the trip is booked within the 30-day window—even if the reservation occurs later. What are the mileage overage rates? Mileage over age rates are the same across all plan options: $.67 per mile over the amount included with your membership plan. Will there be an annual option ? Currently, Lite and Plus are monthly-only plans. Annual memberships are not yet available for these tiers.", "source": "support.zipcar.com"}
{"url": "https://support.zipcar.com/hc/en-us/articles/45080325138963-Which-Payment-Methods-are-Accepted", "api_url": "https://support.zipcar.com/api/v2/help_center/en-us/articles/45080325138963.json", "title": "Which Payment Methods are Accepted?", "last_updated": "2025-09-26T15:55:46Z", "section_id": 115000306327, "body": "Zipcar accepts major credit and debit cards (Visa, Mastercard, American Express, Discover). You may also use Apple Pay or Google Pay for the initial reservation, however, you must have a default credit or debit card on file for all other fees; including membership fees, tolls, and other trip-related expenses. At this time, Zipcar does not accept prepaid cards of any kind, re-loadable or not. Zipcar also does not support buy now, pay later options such as Klarna or Affirm.", "source": "support.zipcar.com"}
